
_detalhes_global = {
	["npcid_pool"] = {
		[1020] = "杂斑迅猛龙",
		[1021] = "杂斑尖啸龙",
		[511] = "疯狂的食尸鬼",
		[1022] = "杂斑镰爪龙",
		[1023] = "杂斑刺喉龙",
		[1024] = "蓝腮鱼人",
		[1025] = "蓝腮污水鱼人",
		[1026] = "蓝腮强盗",
		[1027] = "蓝腮战士",
		[1028] = "蓝腮泥浆鱼人",
		[515] = "鱼人袭击者",
		[1030] = "黑色泥浆怪",
		[4116] = "砂齿勘探员",
		[1032] = "黑色软泥怪",
		[6170] = "加特斯比尔",
		[1034] = "龙喉袭击者",
		[518] = "犹勒",
		[1036] = "龙喉百夫长",
		[4140] = "恐蝎劫掠者",
		[1038] = "龙喉暗影守卫",
		[1039] = "沼泽定居者",
		[1040] = "沼泽爬行者",
		[6206] = "洞窟穴居者",
		[6210] = "洞窟抢劫者",
		[6218] = "辐射泥浆怪",
		[6222] = "麻疯技师",
		[6226] = "机械烈焰行者",
		[6230] = "动力保安装甲",
		[6234] = "机械守护者",
		[1051] = "黑铁矮人",
		[2102] = "龙喉步兵",
		[6250] = "海蟹",
		[1054] = "黑铁爆破手",
		[1057] = "龙喉白骨守卫",
		[531] = "骸骨魔",
		[1062] = "可怕的奈兹里奥克",
		[4248] = "杂毛土狼",
		[1065] = "河爪萨满祭司",
		[7329] = "枯萎野猪人守卫",
		[7333] = "枯萎战斗野猪",
		[7337] = "亡首通灵师",
		[7341] = "骷髅冰霜法师",
		[7345] = "碎骨统帅",
		[7349] = "墓穴魔",
		[7353] = "寒冰之灵",
		[7357] = "火眼莫德雷斯",
		[7361] = "格鲁比斯",
		[4296] = "血色老兵",
		[4300] = "血色巫师",
		[4304] = "血色捕猎犬",
		[4308] = "自由的幽魂",
		[1081] = "泥沼之王",
		[1082] = "盐齿鳄鱼",
		[2164] = "狂暴蓟熊",
		[1084] = "小盐齿鳄鱼",
		[1085] = "老年荆棘谷猛虎",
		[1087] = "盐齿钳嘴鳄",
		[4344] = "尘泥杂斑鳄鱼",
		[4352] = "血沼尖啸龙",
		[4360] = "黑鳍战士",
		[1094] = "风险投资公司矿工",
		[548] = "鱼人小招潮者",
		[7445] = "熊",
		[6426] = "痛苦的死者",
		[4392] = "腐蚀性的沼泽软泥怪",
		[5419] = "晶鳞蜥蜴",
		[3225] = "高雅",
		[4412] = "暗牙爬行者",
		[4416] = "迪菲亚赤膊矿工",
		[4420] = "主宰拉姆塔斯",
		[4424] = "阿格姆",
		[1109] = "碎尸鸟",
		[3241] = "豹",
		[4436] = "剃刀沼泽卫兵",
		[4440] = "剃刀沼泽图腾师",
		[1114] = "丛林大猩猩",
		[3255] = "赤鳞尖啸龙",
		[4464] = "黑石角斗士",
		[3261] = "刺背织棘者",
		[3263] = "刺背地卜师",
		[2242] = "辛迪加间谍",
		[1123] = "霜鬃猎头者",
		[1124] = "霜鬃暗法师",
		[2248] = "洞穴雪人",
		[2252] = "破碎岭食人魔",
		[2254] = "破碎岭虐待者",
		[565] = "疯狂的恐狼",
		[4512] = "腐烂的阿迦玛",
		[4516] = "亡首专家",
		[4520] = "剃刀沼泽地占师",
		[4528] = "石行者 <剃刀沼泽地占师>",
		[10079] = "卫兵穆赫·月角",
		[4540] = "血色僧侣",
		[285] = "鱼人",
		[4548] = "钢齿土狼",
		[1142] = "莫什奥格蛮兵",
		[1144] = "莫什奥格巫医",
		[36] = "麦田傀儡",
		[575] = "火元素",
		[1150] = "淡水鳄",
		[1151] = "海鳄",
		[1152] = "钳嘴鳄鱼",
		[578] = "鱼人斥候",
		[579] = "暗皮刺客",
		[1158] = "被诅咒的水兵",
		[1159] = "大副斯涅利格",
		[4632] = "科卡尔半人马",
		[4636] = "科卡尔队长",
		[4640] = "玛格拉姆争斗者",
		[4644] = "玛格拉姆掠夺者",
		[583] = "迪菲亚伏击者",
		[4656] = "玛洛迪虐待者",
		[4660] = "玛洛迪骨爪土狼",
		[4664] = "火刃劫掠者",
		[4668] = "火刃召唤师",
		[4672] = "怨怒魔仆",
		[4676] = "次级地狱火",
		[1172] = "坑道鼠歹徒",
		[4684] = "地狱巫女",
		[4688] = "骨爪土狼",
		[4692] = "恐怖飞扑者",
		[1176] = "坑道鼠征粮官",
		[589] = "迪菲亚抢劫者",
		[2354] = "邪恶的灰熊",
		[2356] = "老灰熊",
		[4712] = "滑刃巫师",
		[4716] = "滑刃潮行者",
		[4728] = "砂腭蜥蜴",
		[1186] = "老黑熊",
		[2372] = "泥嘴豺狼人",
		[2374] = "碎鳍泥浆鱼人",
		[595] = "血顶猎人",
		[596] = "被洗脑的贵族",
		[597] = "血顶狂战士",
		[1195] = "森林潜伏者",
		[3415] = "豹",
		[300] = "扎克乌尔",
		[1200] = "摩本特·费尔",
		[1201] = "雪豹",
		[7873] = "剃刀沼泽护卫者",
		[2406] = "山地狮",
		[2408] = "海龟",
		[604] = "瘟疫食尸鬼",
		[11686] = "鬼魅掠夺者",
		[2416] = "破碎岭掠夺者",
		[5855] = "熔岩元素",
		[2420] = "塔尔格",
		[2422] = "戈洛姆斯",
		[2434] = "暗影刺客",
		[2440] = "醉酒的劫匪",
		[3475] = "豹",
		[615] = "黑石追踪者",
		[2462] = "食腐虫",
		[1236] = "狗头人掘地工",
		[619] = "迪菲亚咒术师",
		[622] = "地精工程师",
		[623] = "骷髅矿工",
		[624] = "亡灵挖掘者",
		[625] = "亡灵爆破者",
		[1251] = "裂拳好战者",
		[314] = "伊莉莎",
		[6035] = "剃刀沼泽捕猎者",
		[315] = "斯塔文·密斯特曼托",
		[1259] = "高布勒尔",
		[2520] = "遥控傀儡 <地精工程师>",
		[103] = "加瑞克·帕德弗特",
		[1083] = "鱼人巡滩者",
		[1096] = "风险投资公司地质学家",
		[1121] = "霜鬃雪行者",
		[2530] = "耶尼库",
		[634] = "迪菲亚监工",
		[2240] = "辛迪加劫匪",
		[2536] = "火柴棍乔乔",
		[1270] = "恶臭的食尸鬼",
		[636] = "迪菲亚黑衣卫兵",
		[1211] = "麻疯侏儒",
		[687] = "丛林捕猎者",
		[6111] = "火焰新星图腾 II <石窟萨满祭司>",
		[40] = "狗头人矿工",
		[3947] = "地精造船师",
		[2552] = "枯木巨魔",
		[2554] = "枯木掷斧者",
		[3579] = "石爪图腾",
		[2558] = "枯木狂战士",
		[2560] = "高地长尾龙",
		[4097] = "加拉克狂怒者",
		[642] = "斯尼德的伐木机",
		[2566] = "石拳蛮兵",
		[643] = "斯尼德 <斯尼德的伐木机>",
		[4113] = "砂齿掘地工",
		[2572] = "枯须狗头人",
		[6167] = "雌奇美拉",
		[645] = "曲奇",
		[14388] = "未知目标",
		[646] = "重拳先生",
		[504] = "迪菲亚捕兽者",
		[647] = "绿皮队长",
		[2586] = "辛迪加路霸",
		[2588] = "辛迪加潜伏者",
		[2590] = "辛迪咒术师",
		[2592] = "顽石流放者",
		[6207] = "洞窟伏击者",
		[6211] = "洞窟劫掠者",
		[6215] = "咀嚼者",
		[6219] = "酸性潜伏者",
		[6223] = "麻疯防御者",
		[6227] = "机械冰霜行者",
		[6231] = "尖端机器人",
		[6235] = "电刑器6000型",
		[6239] = "塞克隆尼亚",
		[732] = "鱼人潜伏者",
		[3981] = "沃瑞尔·森加斯",
		[2894] = "石窟萨满祭司",
		[2618] = "落锤苦工",
		[4301] = "血色百夫长",
		[686] = "鞭尾迅猛龙",
		[2624] = "加兹班",
		[4696] = "荒土巨钳蝎",
		[4044] = "黑色石化蜥蜴",
		[2630] = "地缚图腾 <我就是这么猛>",
		[3417] = "未知目标 <迪菲亚法师>",
		[4040] = "洞穴捕猎者",
		[660] = "血顶巫医",
		[4249] = "杂毛嚎叫者",
		[1184] = "峭壁潜伏者",
		[4036] = "游荡的焰灵",
		[4034] = "狂怒的石灵",
		[7334] = "恐怖战斗野猪",
		[4032] = "奇美拉幼崽",
		[7342] = "骷髅召唤者",
		[7346] = "碎骨百夫长",
		[4281] = "血色斥候",
		[4285] = "血色追随者",
		[4289] = "血色招魂师",
		[4293] = "血色占卜师",
		[4297] = "血色咒术师",
		[667] = "未知目标",
		[334] = "加塞尔佐格",
		[7354] = "拉戈斯诺特",
		[1008] = "混血藓皮豺狼人",
		[669] = "劈颅猎人",
		[335] = "森格",
		[2676] = "微型收割机 <风险投资公司修理工>",
		[13019] = "火刃先知",
		[671] = "血顶猎头者",
		[4024] = "血怒杀戮者",
		[4341] = "尘泥鳄鱼",
		[7414] = "法力之泉图腾 II <我就是这么猛>",
		[4022] = "血怒鹰身人",
		[588] = "血顶斥候",
		[674] = "风险投资公司露天矿工",
		[4361] = "黑鳍泥浆鱼人",
		[675] = "风险投资公司工头",
		[3381] = "南海歹徒",
		[676] = "风险投资公司勘探员",
		[4377] = "暗雾潜伏者",
		[6427] = "鬼魅幻影",
		[4673] = "怨怒背叛者",
		[678] = "莫什奥格虐待者",
		[4393] = "酸性沼泽软泥怪",
		[6523] = "黑铁火枪手",
		[4401] = "污壳巨钳龙虾人",
		[2716] = "火烟猎龙者",
		[2718] = "火烟萨满祭司",
		[4413] = "暗牙蜘蛛",
		[4417] = "迪菲亚工头",
		[4421] = "卡尔加·刺肋",
		[1364] = "邪恶的巴尔加拉斯",
		[2728] = "野生峭壁山狗",
		[1167] = "碎石怪掘地工",
		[4437] = "剃刀沼泽守卫",
		[6487] = "奥法师杜安",
		[10928] = "魅魔",
		[513] = "撒网鱼人",
		[2740] = "暗炉巫师",
		[4457] = "黑腮强盗",
		[4461] = "黑腮战士",
		[594] = "迪菲亚匪徒",
		[688] = "石喉蜥蜴",
		[327] = "金牙",
		[689] = "晶背蜥蜴",
		[345] = "贝利格拉布",
		[690] = "冷眼蜥蜴",
		[580] = "赤脊山苦工",
		[2760] = "烈焰流放者",
		[2762] = "雷霆流放者",
		[6547] = "受难的牺牲者",
		[38] = "迪菲亚暴徒",
		[171] = "鱼人战士",
		[2320] = "纳伽兹",
		[9026] = "征服者派隆",
		[43] = "矿洞蜘蛛",
		[4525] = "剃刀沼泽裂地者",
		[6575] = "血色预备兵",
		[696] = "劈颅掷斧者",
		[8585] = "未知目标 <寒冰之王亚门纳尔>",
		[697] = "血顶萨满祭司",
		[3809] = "灰谷熊",
		[3811] = "麦浪",
		[4532] = "剃刀沼泽兽王",
		[1397] = "霜鬃先知",
		[698] = "血顶猛虎",
		[570] = "食脑者",
		[1400] = "湿地鳄鱼",
		[3823] = "幽爪奔跑者",
		[5600] = "戴兹帕可汗",
		[702] = "血顶食腐者",
		[587] = "血顶战士",
		[703] = "范高雷中尉",
		[5616] = "废土窃贼",
		[2830] = "秃鹫",
		[1417] = "湿地鳄鱼幼崽",
		[4641] = "玛格拉姆逐风者",
		[2742] = "暗炉吟唱者",
		[2256] = "破碎岭执行者",
		[3974] = "驯犬者洛克希",
		[2734] = "豹",
		[683] = "猎豹幼崽",
		[2244] = "辛迪加暗影法师",
		[4633] = "科卡尔斥候",
		[709] = "莫什奥格好战者",
		[1418] = "蓝腮袭击者",
		[710] = "莫什奥格法师",
		[691] = "次级水元素",
		[2208] = "灰雾潮行者",
		[2562] = "石拳食人魔",
		[712] = "赤脊山鞭笞者",
		[4665] = "火刃老兵",
		[4376] = "黑雾蜘蛛",
		[2850] = "断牙",
		[4677] = "末日看守",
		[4681] = "法师猎手",
		[12431] = "虾米",
		[4689] = "饥饿的骨爪土狼",
		[4693] = "恐怖飞鸟",
		[4697] = "荒土鞭尾蝎",
		[2736] = "巨型石元素",
		[4292] = "血色保卫者",
		[4428] = "亡语者贾格巴",
		[4713] = "滑刃战士",
		[2720] = "火烟食人魔法师",
		[5843] = "奴隶工",
		[4637] = "科卡尔摧毁者",
		[4729] = "笨重的砂腭蜥蜴",
		[3903] = "灼热图腾 III <Teacherzz>",
		[1160] = "哈林多尔船长",
		[7358] = "寒冰之王亚门纳尔",
		[1097] = "风险投资公司技工",
		[539] = "小型结网毒蜘蛛",
		[1095] = "风险投资公司经理",
		[2892] = "石窟先知",
		[11560] = "玛格拉姆鬼魂",
		[672] = "劈颅逐灵者",
		[11576] = "旋风撕裂者",
		[46] = "鱼人强盗",
		[7846] = "吞噬者特雷姆斯",
		[4260] = "风险投资公司伐木机",
		[4288] = "血色驯兽员",
		[728] = "巴尔瑟拉",
		[3983] = "审讯员韦沙斯",
		[729] = "辛达尔",
		[10617] = "加拉克信使",
		[730] = "泰希斯",
		[199] = "小碎尸鸟",
		[731] = "豹",
		[5840] = "黑铁锻造师",
		[5844] = "黑铁奴隶贩子",
		[4825] = "海龟",
		[5852] = "地狱元素",
		[657] = "迪菲亚海盗",
		[5860] = "暮光黑暗萨满祭司",
		[92] = "石元素",
		[735] = "鱼人士兵",
		[747] = "沼泽鱼人",
		[736] = "肉肉",
		[1053] = "黑铁隧道工",
		[2944] = "索格伦",
		[2946] = "赫尔库拉的傀儡 <赫尔库拉的遗骸>",
		[4284] = "血色预言师",
		[98] = "河爪监工",
		[3975] = "赫洛德",
		[3977] = "大检察官怀特迈恩",
		[740] = "翠绿幼龙",
		[2958] = "草原狼",
		[741] = "睡梦雏龙",
		[4645] = "玛格拉姆虐待者",
		[764] = "沼泽漫步者",
		[3989] = "风险投资公司樵夫",
		[3991] = "风险投资公司砍树工",
		[391] = "老瞎眼",
		[1487] = "裂拳奴役者",
		[1488] = "赞吉尔僵尸",
		[2976] = "风险投资公司苦力",
		[1490] = "赞吉尔巫医",
		[1491] = "赞吉尔纳迦",
		[533] = "夜行织影狼人",
		[4007] = "深苔毒蜘蛛",
		[3619] = "我也很难",
		[3904] = "灼热图腾 IV <艾尔文一筱>",
		[4150] = "盐石凝视者",
		[2992] = "治疗结界 V <剃刀沼泽图腾师>",
		[701] = "血顶秘法师",
		[750] = "沼泽喷墨鱼人",
		[94] = "迪菲亚小偷",
		[751] = "沼泽食腐鱼人",
		[4025] = "血怒伏击者",
		[4027] = "血怒雷巫",
		[4029] = "黑色古树",
		[4031] = "奇美拉雏兽",
		[6016] = "防护元素图腾 <亡首圣贤>",
		[4035] = "暴烈的石灵",
		[4037] = "燃烧的掠夺者",
		[755] = "泥泞失落者",
		[4041] = "炭色石化蜥蜴",
		[756] = "劈颅黑豹",
		[2350] = "森林食苔蛛",
		[757] = "失落者渔夫",
		[2103] = "龙喉斥候",
		[4715] = "滑刃刺尾纳迦",
		[95] = "迪菲亚走私者",
		[759] = "失落者猎人",
		[4711] = "滑刃纳迦",
		[760] = "失落定居者",
		[4124] = "千针石林山狮",
		[7099] = "猫头鹰",
		[4065] = "黑石哨兵",
		[4067] = "夜行虎",
		[2091] = "纳克罗什酋长",
		[1554] = "吸血夜行蝙蝠",
		[522] = "摩拉迪姆",
		[3] = "食腐者",
		[1548] = "被诅咒的黑暗犬",
		[765] = "沼泽漫步者长老",
		[6112] = "风怒图腾 <Jackie>",
		[766] = "纠缠恐兽",
		[2089] = "巨型湿地鳄鱼",
		[767] = "沼泽虎",
		[6224] = "麻疯机械师",
		[6132] = "剃刀沼泽仆从",
		[1120] = "未知目标",
		[1537] = "血色狂热者",
		[1538] = "血色苦行修士",
		[4675] = "怨怒唤魔者",
		[5643] = "泰拉尼斯·玛雷姆",
		[644] = "拉克佐",
		[4663] = "火刃预言师",
		[772] = "荆棘谷雌虎",
		[6168] = "鲁古格",
		[4126] = "峭壁捕猎者",
		[1029] = "蓝腮智者",
		[2069] = "月夜猛虎",
		[97] = "矮小的河爪豺狼人",
		[1549] = "饥饿的黑暗犬",
		[1550] = "钢尾蜥蜴",
		[1551] = "铁腭蜥蜴",
		[4154] = "盐湖食腐鹫",
		[4158] = "盐湖秃鹫",
		[6208] = "洞窟入侵者",
		[6212] = "黑铁密探",
		[641] = "地精木匠",
		[1557] = "老迈的迷雾谷猩猩",
		[1558] = "银背雌猩猩",
		[780] = "劈颅秘法师",
		[6232] = "施法者克星X-21",
		[1561] = "血帆袭击者",
		[1562] = "血帆法师",
		[782] = "劈颅斥候",
		[1564] = "血帆术士",
		[121] = "迪菲亚巡路者",
		[1035] = "龙喉沼泽行者",
		[784] = "劈颅兽王",
		[5089] = "巴鲁斯·加科因",
		[785] = "骷髅看守",
		[598] = "迪菲亚矿工",
		[11521] = "科多幽灵",
		[2831] = "巨型秃鹫",
		[787] = "骷髅医师",
		[1163] = "未知目标",
		[12576] = "瑞什·远行者",
		[11561] = "亡灵劫掠者",
		[4290] = "血色卫兵",
		[7327] = "枯萎战士",
		[2348] = "老食苔蛛",
		[7335] = "亡首地卜师",
		[4095] = "加拉克虐待者",
		[7343] = "碎骨骷髅",
		[7347] = "嚼骨食尸鬼",
		[7351] = "墓穴劫掠者",
		[7355] = "图特卡什",
		[397] = "莫甘斯",
		[4294] = "血色魔术师",
		[4298] = "血色防御者",
		[4302] = "血色勇士",
		[4306] = "血色拷问者",
		[4624] = "藏宝海湾地精卫兵",
		[481] = "迪菲亚拦路贼",
		[11577] = "旋风雷暴行者",
		[11785] = "黄眼蜥蜴",
		[1052] = "黑铁破坏者",
		[5618] = "废土强盗",
		[1108] = "猩猩",
		[6020] = "滑壳龙虾人",
		[4342] = "尘泥锐爪鳄鱼",
		[7415] = "法力之泉图腾 III <莫灬萨>",
		[4438] = "剃刀沼泽刺鬃守卫",
		[824] = "迪菲亚掘地工",
		[4358] = "黑鳍污水鱼人",
		[4362] = "黑鳍滩行鱼人",
		[6412] = "骷髅",
		[2714] = "被遗忘者信使",
		[205] = "夜行黑暗狼人",
		[4378] = "暗雾独行蛛",
		[4382] = "枯藤爬行者",
		[4654] = "玛洛迪斥候",
		[8996] = "虚空行者 <迪菲亚咒术师>",
		[4518] = "亡首圣贤",
		[202] = "恐怖骸骨",
		[5425] = "饥饿的疱爪土狼",
		[4526] = "风嚎者",
		[4530] = "剃刀沼泽训练师",
		[4414] = "暗牙毒蜘蛛",
		[4418] = "迪菲亚巫师",
		[4422] = "暴怒的阿迦赛罗斯",
		[4534] = "被驯服的土狼 <剃刀沼泽兽王>",
		[203] = "骷髅法师",
		[626] = "工头希斯耐特",
		[11937] = "恶魔之门的卫士",
		[4442] = "剃刀沼泽防御者",
		[813] = "库尔森上校",
		[2783] = "玛雷兹·考尔",
		[814] = "玛尔苏斯中士",
		[4458] = "黑腮猎人",
		[4462] = "黑石猎人",
		[3258] = "刺背猎手",
		[3260] = "刺背寻水者",
		[599] = "玛里莎·杜派格",
		[2241] = "辛迪加窃贼",
		[2243] = "辛迪加哨兵",
		[2245] = "辛迪加破坏者",
		[2247] = "辛迪加执行者",
		[2249] = "凶恶的雪人",
		[4531] = "剃刀沼泽驯兽师",
		[2253] = "破碎岭蛮兵",
		[2255] = "破碎岭法师",
		[2257] = "玛格索尔",
		[4514] = "未知目标",
		[2261] = "辛迪加卫士",
		[4522] = "剃刀沼泽织尘者",
		[206] = "夜行邪齿狼人",
		[412] = "未知目标",
		[7603] = "麻疯助手",
		[4538] = "沼泽蝙蝠",
		[4542] = "大检察官法尔班克斯",
		[1666] = "卡姆·深怒",
		[9377] = "空气漩涡",
		[2773] = "奥卡拉尔",
		[4515] = "亡首侍僧",
		[949] = "食腐独行蛛",
		[210] = "噬骨者",
		[2287] = "破碎岭好战者",
		[10323] = "莫克迪普",
		[5601] = "杰恩可汗",
		[474] = "迪菲亚流浪巫师",
		[947] = "沉默的罗恩",
		[4694] = "恐怖撕裂者",
		[416] = "达格哈姆",
		[832] = "尘魔",
		[4714] = "滑刃侍从",
		[833] = "山狗首领",
		[417] = "卡霍恩",
		[834] = "山狗",
		[4718] = "滑刃智者",
		[426] = "赤脊山蛮兵",
		[1707] = "迪菲亚俘虏",
		[858] = "沼泽纺丝蛛",
		[2319] = "辛迪加巫师",
		[4638] = "玛格拉姆斥候",
		[4642] = "玛格拉姆狂怒者",
		[1715] = "迪菲亚叛军",
		[2745] = "因弗努斯大使",
		[12369] = "科拉加鲁",
		[2743] = "暗炉战士",
		[4662] = "玛格拉姆骨爪土狼",
		[4666] = "火刃魔仆",
		[4670] = "怨怒潜行者",
		[4674] = "怨怒巡影者",
		[4678] = "噬法魔犬",
		[1726] = "迪菲亚法师",
		[4686] = "深海巨人",
		[4690] = "疯狂的骨爪土狼",
		[2349] = "巨型食苔蛛",
		[2739] = "暗炉隧道工",
		[941] = "库尔森精神医师",
		[423] = "混血赤脊山豺狼人",
		[2433] = "赫尔库拉的遗骸",
		[3382] = "南海炮兵",
		[212] = "裂拳战士",
		[424] = "赤脊山偷猎者",
		[4726] = "暴怒的雷霆蜥蜴",
		[1696] = "可怕的塔格尔",
		[2369] = "刺脊滩行者",
		[2371] = "刺脊海妖",
		[2373] = "泥嘴萨满祭司",
		[2375] = "碎鳍滩行鱼人",
		[2377] = "碎鳍潮行鱼人",
		[8477] = "骷髅仆从 <亡首通灵师>",
		[940] = "库尔森药草师",
		[11562] = "枯钳龙虾人",
		[2385] = "野生山地狮",
		[1706] = "迪菲亚囚徒",
		[854] = "幼年丛林捕猎者",
		[1708] = "迪菲亚狱友",
		[855] = "幼年荆棘谷迅猛龙",
		[428] = "恐鹫",
		[1711] = "迪菲亚罪犯",
		[2731] = "山脊巡行者",
		[1713] = "豹",
		[429] = "暗皮巫师",
		[2405] = "塔伦米尔亡灵卫兵",
		[1716] = "巴基尔·斯瑞德",
		[215] = "迪菲亚夜行者",
		[430] = "赤脊山秘法师",
		[2729] = "小白",
		[2727] = "峭壁山狗",
		[861] = "斯通纳德斥候",
		[431] = "暗皮杀手",
		[2421] = "玛克拉克",
		[3450] = "迪菲亚鹦鹉",
		[7915] = "步行炸弹",
		[432] = "暗皮蛮兵",
		[1727] = "迪菲亚工人",
		[2723] = "石头傀儡",
		[1729] = "迪菲亚招魂师",
		[433] = "暗皮豺狼人",
		[1731] = "地精工匠",
		[1732] = "迪菲亚塑风师",
		[217] = "结网毒蜘蛛",
		[434] = "疯狂的暗皮豺狼人",
		[2721] = "被遗忘者保镖",
		[871] = "盐鳞战士",
		[3472] = "秘书",
		[435] = "黑石勇士",
		[12865] = "玛克林大使",
		[5929] = "熔岩图腾 <枯木巫医>",
		[218] = "盗墓者",
		[436] = "黑石暗影法师",
		[2717] = "火烟虐待者",
		[1725] = "迪菲亚哨兵",
		[873] = "盐鳞智者",
		[437] = "黑石叛节者",
		[628] = "黑色破坏者",
		[4541] = "阿迦玛甘之血",
		[875] = "盐鳞首领",
		[1111] = "吸血捕猎者",
		[8035] = "黑铁地雷 <黑铁密探>",
		[11921] = "蜘蛛",
		[877] = "盐鳞强盗",
		[1042] = "红色雏龙",
		[4966] = "亨德尔下士",
		[1756] = "奥妮克希亚的精英护卫",
		[879] = "盐鳞猎人",
		[440] = "黑石步兵",
		[7028] = "黑石术士",
		[2701] = "火烟食人魔",
		[6021] = "野猪之魂 <阿格姆>",
		[6017] = "熔岩喷射图腾 <亡首先知>",
		[1763] = "基尔尼格",
		[2384] = "饥饿的山地狮",
		[4363] = "黑鳍智者",
		[442] = "狼蛛",
		[4359] = "黑鳍鱼人",
		[525] = "癞皮狼",
		[3100] = "野猪",
		[856] = "幼年鞭尾迅猛龙",
		[5853] = "温和的作战傀儡",
		[3424] = "雷鹰破云者",
		[445] = "赤脊山突击队员",
		[2563] = "平原狼蛛",
		[891] = "裂拳控火者",
		[448] = "霍格",
		[889] = "裂拳食人魔",
		[2531] = "莫甘斯的爪牙 <莫甘斯>",
		[2569] = "石拳虐待者",
		[2535] = "“畸形足”玛雷·维尔金斯",
		[3560] = "治疗结界 <血顶巫医>",
		[446] = "赤脊山猛击者",
		[892] = "裂拳工头",
		[3566] = "平原徘徊者",
		[2545] = "帅小伙子邓肯",
		[2573] = "枯须勘探员",
		[4415] = "巨型暗牙蜘蛛",
		[4151] = "盐石水晶蜥蜴",
		[2553] = "枯木暗影法师",
		[2555] = "枯木巫医",
		[2557] = "枯木暗影猎手",
		[2559] = "高地阔步龙",
		[2561] = "高地猎兽龙",
		[4099] = "加拉克掠夺者",
		[2565] = "巨型平原狼蛛",
		[2567] = "石拳法师",
		[4111] = "砂齿狗头人",
		[450] = "迪菲亚叛节法师",
		[4119] = "风蛇",
		[2575] = "黑铁后勤兵",
		[923] = "黑色破坏者幼崽",
		[2579] = "山地秃鹰",
		[921] = "风险投资公司伐木工",
		[4139] = "恐蝎",
		[6229] = "群体打击者9-60",
		[452] = "河爪强盗",
		[2589] = "辛迪加雇佣兵",
		[2591] = "辛迪加占星师",
		[905] = "利齿狂鱼",
		[2619] = "落锤步兵",
		[6213] = "辐射入侵者",
		[2599] = "奥图",
		[6221] = "混乱的麻疯侏儒",
		[4287] = "血色豪侠",
		[1815] = "生病的黑熊",
		[6233] = "机械哨兵",
		[909] = "迪菲亚夜贼",
		[4283] = "血色哨兵",
		[910] = "迪菲亚附魔师",
		[114] = "看守傀儡",
		[7348] = "噬棘食尸鬼",
		[1822] = "毒雾潜伏者",
		[2621] = "落锤卫士",
		[1128] = "黑熊幼崽",
		[2574] = "枯须掘地工",
		[7356] = "腐烂的普雷莫尔",
		[6329] = "辐射抢劫者",
		[2587] = "辛迪加巡路者",
		[2635] = "老海鳄",
		[458] = "打猎鱼人",
		[2570] = "石拳萨满祭司",
		[11563] = "枯钳巨螯龙虾人",
		[2597] = "法库雷斯特公爵",
		[7328] = "枯萎掠夺者",
		[7332] = "枯萎矛鬃野猪人",
		[115] = "收割傀儡",
		[7340] = "骷髅暗影法师 <骷髅召唤者>",
		[7344] = "碎骨战士",
		[920] = "夜行堕落狼人",
		[7352] = "冰冻之魂",
		[8566] = "黑铁哨兵",
		[4291] = "血色教士",
		[4295] = "血色仆从",
		[4299] = "血色牧师",
		[4303] = "血色修士",
		[2667] = "懒惰结界",
		[4147] = "盐石蜥蜴",
		[1717] = "哈姆霍克",
		[2571] = "石拳领主",
		[898] = "夜行狼人",
		[449] = "迪菲亚拳匪",
		[116] = "迪菲亚强盗",
		[6093] = "蛀牙杰克",
		[456] = "小鱼人智者",
		[4343] = "尘泥钳嘴鳄鱼",
		[2556] = "枯木猎头者",
		[4351] = "血沼迅猛龙",
		[11578] = "旋风切割者",
		[930] = "小型黑寡妇蜘蛛",
		[1860] = "未知目标",
		[822] = "森林熊幼崽",
		[441] = "黑龙雏龙",
		[1863] = "杜姆纳",
		[4379] = "暗雾纺丝者",
		[12977] = "科卡尔伏击者",
		[5184] = "塞拉摩哨兵",
		[4391] = "沼泽软泥怪",
		[117] = "河爪豺狼人",
		[5422] = "沙漠猎食蝎",
		[2715] = "火烟蛮兵",
		[1871] = "未知目标 <伊莉莎>",
		[4411] = "暗牙潜伏者",
		[937] = "库尔森丛林战士",
		[12922] = "小鬼爪牙",
		[938] = "库尔森特种兵",
		[4427] = "结界卫士",
		[939] = "未知目标",
		[4435] = "剃刀沼泽战士",
		[2733] = "药剂师乔瑞尔",
		[2735] = "次级石元素",
		[6493] = "幻象之影 <鬼魅幻影>",
		[471] = "母蜘蛛",
		[942] = "库尔森巫医",
		[118] = "觅食的灰狼",
		[4463] = "黑石召唤师",
		[5861] = "暮光火焰卫士",
		[862] = "斯通纳德探险者",
		[2417] = "守财奴格雷尔伯格",
		[2407] = "巨型山地狮",
		[213] = "饥饿的恐狼",
		[946] = "霜鬃巨魔新兵",
		[422] = "鱼人食腐者",
		[2761] = "水浪流放者",
		[2763] = "瑟恩纳",
		[948] = "腐烂者",
		[4634] = "科卡尔虐待者",
		[4511] = "阿迦玛",
		[475] = "狗头人隧道工",
		[4519] = "亡首先知",
		[4523] = "剃刀沼泽震地者",
		[1663] = "迪克斯特·瓦德",
		[476] = "狗头人地卜师",
		[4535] = "被驯服的斗猪 <剃刀沼泽训练师>",
		[4539] = "巨型沼泽蝙蝠",
		[4543] = "血法师萨尔诺斯",
		[3810] = "未知目标",
		[1907] = "纳迦探险者",
		[2791] = "被激怒的石元素",
		[2793] = "考格雷什",
		[478] = "河爪豺狼人前锋",
		[819] = "伊尔加拉的仆从",
		[12976] = "科卡尔抢劫者",
		[4969] = "旧城区暴徒",
		[30] = "森林蜘蛛",
		[639] = "艾德温·范克里夫",
		[1258] = "巨型黑色破坏者",
		[4517] = "亡首祭司",
		[480] = "生锈的麦田傀儡",
		[5622] = "盎格库尔",
		[761] = "失落者先知",
		[762] = "失落寻隙者",
		[1922] = "森林灰狼",
		[48] = "骷髅战士",
		[517] = "鱼人智者",
		[4623] = "野猪人勇士",
		[568] = "暗皮战士",
		[2829] = "饥饿的秃鹫",
		[4635] = "科卡尔逐风者",
		[4639] = "玛格拉姆前锋",
		[4643] = "玛格拉姆驯犬者",
		[768] = "暗影黑豹",
		[3862] = "小灰灰 <呆呆阿呆>",
		[4655] = "玛洛迪争斗者",
		[4659] = "玛洛迪掠夺者",
		[7732] = "复制虫 <尖端机器人>",
		[4667] = "火刃暗影法师",
		[4671] = "怨怒欺诈者",
		[485] = "黑石前锋",
		[4679] = "地狱魔女",
		[4128] = "乱齿捕猎者",
		[2580] = "老山地秃鹰",
		[486] = "萨瑞尔祖恩",
		[4695] = "恐怖腐化鸟",
		[4699] = "荒土毒尾蝎",
		[6220] = "辐射水元素",
		[781] = "劈颅猎头者",
		[61] = "索罗斯·莱特芬格",
		[122] = "迪菲亚路霸",
		[4719] = "滑刃海巫",
		[4723] = "工头考兹尔",
		[4727] = "老迈的雷霆蜥蜴",
		[7800] = "麦克尼尔·瑟玛普拉格",
		[977] = "库尔森战豹",
		[5771] = "祖格卡",
		[978] = "库尔森副首领",
		[769] = "死亡狼蛛",
		[979] = "库尔森暗影猎手",
		[1110] = "骷髅袭击者",
		[2893] = "石窟断骨者",
		[1563] = "血帆流氓",
		[6240] = "挑衅者",
		[7849] = "移动警报系统",
		[5807] = "风骚的扫荡者",
		[123] = "混血河爪豺狼人",
		[4286] = "血色士兵",
		[2907] = "火烟秘法师",
		[670] = "劈颅巫医",
		[1122] = "霜鬃剥皮者",
		[8567] = "暴食者",
		[7872] = "亡首教徒",
		[677] = "风险投资公司修理工",
		[2919] = "法姆雷托守护者",
		[1353] = "萨尔图斯",
		[2960] = "草原狼前锋",
		[5846] = "黑铁工头",
		[681] = "荆棘谷猛虎幼崽",
		[5854] = "重型作战傀儡",
		[5858] = "巨型熔岩蜘蛛",
		[685] = "荆棘谷迅猛龙",
		[124] = "河爪蛮兵",
		[4023] = "血怒游荡者",
		[682] = "荆棘谷猛虎",
		[569] = "绿色独行蛛",
		[7027] = "黑石杀戮者",
		[2945] = "莫达洛克",
		[1188] = "灰斑黑熊",
		[2246] = "辛迪加刺客",
		[2951] = "白鬃偷猎者",
		[3976] = "血色十字军指挥官莫格莱尼",
		[694] = "血顶掷斧者",
		[1131] = "冬狼",
		[11559] = "玛格拉姆通灵师",
		[7079] = "粘性辐射尘",
		[5922] = "大地之力图腾 III <莫灬萨>",
		[1138] = "未知目标",
		[2324] = "黑木风语者",
		[699] = "血顶兽王",
		[500] = "河爪斥候",
		[11876] = "恶魔灵魂",
		[2975] = "风险投资公司雇员",
		[7874] = "剃刀沼泽织棘者",
		[501] = "河爪草药师",
		[1157] = "被诅咒的水手",
		[4280] = "血色医师",
		[2318] = "暗影大法师",
		[502] = "本尼·布兰科",
		[1165] = "碎石怪地卜师",
		[3239] = "电角蜥蜴",
		[4016] = "灵龙",
		[1426] = "河爪矿工",
		[4020] = "腐蚀兽",
		[126] = "滩行鱼人",
		[1007] = "藓皮豺狼人",
		[4026] = "血怒唤风者",
		[4028] = "烧焦的树人",
		[590] = "迪菲亚强夺者",
		[1009] = "藓皮织雾者",
		[505] = "巨型狼蛛",
		[1010] = "藓皮沼泽行者",
		[4038] = "燃烧的破坏者",
		[1011] = "藓皮捕兽者",
		[4042] = "焦黑石化蜥蜴",
		[1012] = "藓皮蛮兵",
		[2732] = "豹",
		[1013] = "藓皮秘法师",
		[684] = "深喉猎豹",
		[1014] = "藓皮突击队员",
		[127] = "潮行鱼人",
		[1015] = "高地迅猛龙",
		[6066] = "陷地图腾 <剃刀沼泽图腾师>",
		[1016] = "高地鞭尾龙",
		[4062] = "黑铁投弹手",
		[4064] = "黑石斥候",
		[2376] = "碎鳍智者",
		[154] = "大碎尸鸟",
		[1489] = "赞吉尔猎人",
		[752] = "沼泽鱼人智者",
	},
	["death_recap"] = {
		["enabled"] = true,
		["show_segments"] = false,
		["show_life_percent"] = false,
		["relevance_time"] = 7,
	},
	["spell_pool"] = {
		5, -- [1]
		3, -- [2]
		[0] = 5,
		["法术反制"] = 8,
		["神圣净化"] = 1,
		["重伤"] = "身高九米",
		["暗影冥思"] = 9,
		["邪恶攻击"] = 4,
		["昏迷"] = 2,
		["恢复"] = 5,
		["愈合"] = 11,
		["伏击"] = 4,
		["精神"] = 1,
		["急救"] = 1,
		["速效毒药 II"] = 4,
		["血之契印"] = 9,
		["真言术：韧"] = 5,
		[5171] = 4,
		["疲劳诅咒"] = 9,
		["荆棘术"] = 4,
		["喝水"] = 9,
		["感知"] = 1,
		["冷酷"] = 4,
		["速效毒药 III"] = 4,
		["次级力量"] = 1,
		["嘲讽"] = 1,
		[1058] = 11,
		[7301] = 8,
		["雷霆一击"] = 1,
		[21084] = 2,
		["闷棍"] = 4,
		["灵猴守护"] = 3,
		["火箭爆炸"] = 8,
		["冰链术"] = "迪菲亚巫师",
		[17] = 5,
		["斧类武器投掷"] = "地精木匠",
		["烈焰风暴"] = "看好我的蓝",
		["切割"] = 4,
		["出血"] = 4,
		["音素爆破"] = "巨型沼泽蝙蝠",
		["治疗之触"] = 11,
		["侦测隐形"] = 9,
		[139] = 5,
		["快速烈焰防护结界"] = "迪菲亚招魂师",
		["低吼"] = "二毛 <無尽丶殺戮>",
		["猛虎之怒"] = 11,
		["制造魔法玛瑙"] = 8,
		["火焰之盾"] = 1,
		[5487] = 11,
		[8936] = 11,
		["疾病射击"] = "枯萎矛鬃野猪人",
		["霜甲术"] = 8,
		["斩杀"] = 1,
		["压制"] = 1,
		["冰冻"] = 8,
		["寒冰护体"] = 8,
		["枪械射击"] = 1,
		["死亡缠绕"] = 9,
		["打击"] = "迪克斯特·瓦德",
		["战斗命令"] = "迪菲亚监工",
		["闪避"] = 4,
		["召唤遥控傀儡"] = "地精工程师",
		[586] = 5,
		["恢复法力"] = 9,
		[588] = 5,
		["召唤军马"] = 2,
		["无情打击效果"] = 4,
		["包围之风"] = "剃刀沼泽织尘者",
		[592] = 5,
		["震荡射击"] = 3,
		["防护火焰结界"] = 8,
		["重拳猛击"] = "重拳先生",
		["脚踢"] = 4,
		["毒蛇钉刺"] = 3,
		["鬼魅攻击"] = 4,
		["折磨"] = 2,
		["十字军打击"] = "血色豪侠",
		["暗影箭"] = 9,
		["强化震荡射击"] = 3,
		["召唤虚空行者"] = 9,
		["复活宠物"] = 3,
		[604] = 8,
		[20287] = 2,
		["制造块茎"] = "地鼠 <这我不是乱杀>",
		["命令圣印"] = 2,
		["陷地图腾"] = "剃刀沼泽图腾师",
		["正义圣印"] = 2,
		["追踪亡灵"] = 3,
		["圣洁光环"] = 2,
		["腐烂恶臭"] = "腐烂的普雷莫尔",
		["熊形态"] = 11,
		["挥击"] = 11,
		["急奔"] = 11,
		["断线"] = 1,
		["精神鞭笞"] = 5,
		["熔铁之水"] = "基尔尼格",
		["破甲攻击"] = 1,
		[1243] = 5,
		[1244] = 5,
		["反射力场"] = "施法者克星X-21",
		["变形术"] = 8,
		["火焰箭"] = "佐尔亚普 <叶慈>",
		["图特卡什的诅咒"] = "图特卡什",
		["栗色马"] = 8,
		["神圣之灵"] = 5,
		["圣光击"] = "血色老兵",
		["闪电箭"] = "未知目标",
		["法力燃烧链"] = "辐射水元素",
		["猛击"] = 1,
		[13165] = 3,
		["雄鹰守护"] = 3,
		["昏阙"] = 5,
		["毒药"] = "墓穴魔",
		["专注光环"] = 2,
		["冰霜抗性光环"] = 2,
		["圣佑术"] = 2,
		["法力护盾"] = 8,
		["追踪人型生物"] = 3,
		["死亡矿井炸药"] = "亡灵爆破者",
		["旋风倾泻"] = "剃刀沼泽刺鬃守卫",
		["Activate Bomb 06"] = "麦克尼尔·瑟玛普拉格",
		["力量"] = 8,
		["敏捷"] = 3,
		["暴跳如雷"] = "暴怒的阿迦赛罗斯",
		["生命虹吸"] = 9,
		["进食"] = 8,
		["血帆鹦鹉"] = "迪菲亚海盗",
		["法力燃烧"] = "亡首侍僧",
		[5232] = 11,
		["驱散魔法"] = 5,
		["冲锋击昏"] = 1,
		["召唤战斗野猪"] = "剃刀沼泽训练师",
		["致命毒药"] = 4,
		["圣光闪现"] = 2,
		["盾牌猛击"] = "卡姆·深怒",
		["毒云术"] = 4,
		["群体打击"] = "群体打击者9-60",
		["急速射击"] = 3,
		["精灵之火"] = 11,
		["横扫攻击"] = 1,
		["心灵震颤"] = "剃刀沼泽裂地者",
		["残废术"] = "亡首通灵师",
		["烈焰喷射"] = "机械烈焰行者",
		["毒蝎钉刺"] = 3,
		[18371] = 9,
		[673] = 4,
		["偷袭"] = 4,
		["刺穿护甲"] = "迪菲亚矿工",
		["智力"] = 3,
		["智慧祝福"] = 2,
		["毒性鱼叉"] = "绿皮队长",
		["猫鼬撕咬"] = 3,
		["闪现术"] = 8,
		["强效法力药水"] = 11,
		["恐惧嚎叫"] = 9,
		[687] = 9,
		["厚亚麻绷带"] = 1,
		["疾跑"] = 4,
		["缓落术"] = 8,
		["心灵震爆"] = 5,
		[14149] = 4,
		["冰霜陷阱"] = 3,
		[696] = 9,
		["心灵尖啸"] = 5,
		["火焰新星"] = "机械烈焰行者",
		["暴风雪"] = 8,
		["逃命专家"] = 9,
		["冰甲术"] = 8,
		["战斗姿态"] = 1,
		["灵魂虹吸"] = 9,
		["召唤地狱战马"] = 9,
		["狂野怒火"] = 3,
		["强化格挡"] = "剃刀沼泽防御者",
		["鱼肝油"] = 2,
		["惩戒痛击"] = 1,
		["月火术"] = 11,
		["炉石"] = 8,
		["致死打击"] = 1,
		["神恩术"] = 2,
		["催眠术"] = "血色占卜师",
		["雷霆啤酒"] = 8,
		["召唤宠物"] = 3,
		["灵魂石复活"] = 9,
		["拦截昏迷"] = 1,
		["回春药水"] = 5,
		["凶猛撕咬"] = 11,
		["元素诅咒"] = 9,
		["丝质绷带"] = 9,
		[1459] = 8,
		[1460] = 8,
		["Activate Bomb 02"] = "麦克尼尔·瑟玛普拉格",
		["群体清除"] = "施法者克星X-21",
		["十字军审判"] = 2,
		["耐力"] = 8,
		["防护元素图腾"] = "亡首圣贤",
		["献祭"] = 9,
		["破甲"] = 4,
		["奥术射击"] = 3,
		["造食术"] = 8,
		[746] = 4,
		["感知恶魔"] = 9,
		["乱射"] = 3,
		["攻击"] = 5,
		["拉克佐猛击"] = "拉克佐",
		[29131] = 1,
		["生命 II"] = 1,
		["穿刺射击"] = "迪菲亚工头",
		["精制实心弹丸"] = 3,
		["旋风斩效果"] = "赫洛德",
		["摔绊"] = 3,
		["力量祝福"] = 2,
		["范克里夫的盟友"] = "艾德温·范克里夫",
		["治疗波"] = "结界卫士",
		["!Melee"] = 1,
		["多疑"] = 9,
		["致命毒药 II"] = 4,
		[768] = 11,
		[14318] = 3,
		["冰冻陷阱效果"] = 3,
		[10290] = 2,
		["冰霜陷阱光环"] = 3,
		[6192] = 1,
		["公正圣印"] = 2,
		["寒冰箭"] = 8,
		["初级治疗石"] = 1,
		["治疗药水"] = 4,
		[782] = 11,
		["制裁之锤"] = 2,
		["新近包扎"] = 1,
		["真言术：盾"] = 5,
		[5257] = 8,
		["血性狂暴"] = 1,
		["急速冲锋"] = "被驯服的斗猪 <剃刀沼泽训练师>",
		[5277] = 4,
		["恐吓"] = "斯尼德的伐木机",
		["投网"] = "剃刀沼泽守卫",
		["防护恐惧结界"] = 5,
		["牺牲"] = 9,
		["铁皮手雷"] = 3,
		["割裂"] = 4,
		["搜索"] = 4,
		["圣光审判"] = 1,
		["投掷"] = 4,
		["撕咬"] = "野猪 <纯萌新来惹>",
		["补充法力"] = 8,
		["冲击"] = 8,
		["深冬之寒"] = 8,
		["火焰之雨"] = 9,
		["生命分流"] = 9,
		["进食充分"] = 1,
		["神圣打击"] = "血色勇士",
		["活化烈焰"] = "未知目标 <迪菲亚法师>",
		["劣质炸药"] = 4,
		["正义之怒"] = 2,
		["潜行"] = 4,
		["召唤土狼"] = "剃刀沼泽兽王",
		["挫志怒吼"] = 1,
		["痛击"] = "艾德温·范克里夫",
		["消隐"] = "迪菲亚黑衣卫兵",
		["隐藏"] = 1,
		["毒性射击"] = "剃刀沼泽兽王",
		["解除次级诅咒"] = 8,
		["狂怒"] = "可怕的塔格尔",
		["扫击"] = 11,
		["启发"] = 2,
		["酸液溅射"] = "曲奇",
		["猎人印记"] = 3,
		["蓝色机械陆行鸟"] = 8,
		["致残毒药"] = 4,
		["烈性炸药"] = 9,
		["治疗术"] = 5,
		["旅行形态"] = 11,
		["唤醒"] = 8,
		["心灵之火"] = 5,
		["火球术"] = 8,
		["盾牌格挡"] = 1,
		["烈焰震击"] = "血法师萨尔诺斯",
		["拯救祝福"] = 2,
		["Activate Bomb 03B"] = "麦克尼尔·瑟玛普拉格",
		["指挥地鼠"] = 9,
		["魔爆术"] = 8,
		["神圣震击"] = 2,
		["英勇打击"] = 1,
		["激怒"] = 11,
		["狂暴之怒"] = 1,
		["爪击"] = 11,
		["烈焰尖刺"] = "血法师萨尔诺斯",
		["剑刃乱舞"] = 4,
		["治疗祷言"] = 5,
		["快速射击"] = 3,
		["断筋"] = 1,
		["突袭"] = 11,
		[430] = 2,
		["魔法增效"] = 8,
		[431] = 5,
		["地震术"] = "剃刀沼泽震地者",
		["正义审判"] = 2,
		[20375] = 2,
		[432] = 8,
		["冰霜冲击"] = 4,
		["恶魔皮肤"] = 9,
		["亚门纳尔之怒"] = "寒冰之王亚门纳尔",
		[434] = 5,
		["鲁莽诅咒"] = 9,
		["宁静"] = 11,
		["反击风暴"] = 1,
		["狂暴姿态"] = 1,
		["暗影灼烧"] = 9,
		["初级吸收"] = 5,
		[2479] = 5,
		["闪电链"] = "哈姆霍克",
		[5006] = 3,
		["奥术智慧"] = 8,
		["惩击"] = 5,
		["治疗宠物"] = 3,
		["惩罚光环"] = 2,
		[8115] = 2,
		["烟雾弹"] = "巴基尔·斯瑞德",
		["治疗结界"] = "剃刀沼泽图腾师",
		["火焰冲击"] = 8,
		["辐射之云"] = "辐射泥浆怪",
		[15271] = 5,
		["速效毒药"] = 4,
		["纠缠根须"] = 11,
		[2565] = 1,
		["熔化矿石"] = "地精工匠",
		["恐惧术"] = 9,
		["制造初级灵魂石"] = 9,
		["防御姿态"] = 1,
		["恶魔支配"] = 9,
		["复仇"] = 1,
		["盾击"] = 1,
		["圣盾术"] = "血色十字军指挥官莫格莱尼",
		["绞喉"] = 4,
		["游荡瘟疫"] = 1,
		["击退"] = "麦克尼尔·瑟玛普拉格",
		["召唤小鬼"] = 9,
		[5242] = 1,
		["侦测次级隐形"] = 9,
		[7300] = 8,
		["暗影易伤"] = 9,
		["奥术气泡"] = "奥法师杜安",
		["感染之伤"] = "迪菲亚俘虏",
		["熔岩喷射图腾"] = "亡首先知",
		["暗言术：痛"] = 5,
		["魔息术"] = 9,
		["虚弱灵魂"] = 5,
		["冰冻之眼"] = 4,
		["吸血鬼的拥抱"] = 5,
		["自动射击"] = 3,
		["Fire"] = "环境伤害 (火烧)",
		["急速冷却"] = 8,
		["撕裂"] = 1,
		[6074] = 5,
		["怒气"] = 1,
		["爆炸陷阱效果"] = 3,
		["召唤冰霜亡魂"] = "寒冰之王亚门纳尔",
		["撒网"] = "图特卡什",
		[7396] = 3,
		["制造次级灵魂石"] = 9,
		["召唤暗影法师"] = "骷髅召唤者",
		[8096] = 5,
		["冰爆术"] = "机械冰霜行者",
		["治疗石"] = 9,
		["奴役恶魔"] = 9,
		[465] = 2,
		["审判"] = 2,
		["爆炸陷阱"] = 3,
		["治疗"] = "躲起来的医师",
		["命令审判"] = 2,
		["沉默"] = "奥法师杜安",
		["践踏"] = "群体打击者9-60",
		["奉献"] = 2,
		["猎豹守护"] = 3,
		["胁迫"] = 3,
		["怒不可遏"] = 1,
		["血色复活"] = "大检察官怀特迈恩",
		["Falling"] = "环境伤害 (高处坠落)",
		[25780] = 2,
		["精神分流"] = 5,
		[19706] = 5,
		["冲锋"] = 1,
		["刺骨"] = 4,
		["光明圣印"] = 2,
		["魔纹绷带"] = 9,
		["剥皮"] = 1,
		["槌击"] = 11,
		["疾病之云"] = "暴食者",
		["献祭陷阱效果"] = 3,
		[19834] = 2,
		["神圣之火"] = "反叛的萝卜",
		[1784] = 4,
		["护甲"] = 1,
		["充电网"] = "机械守护者",
		["召唤魅魔"] = 9,
		["扰乱之痛"] = "斯尼德的伐木机",
		["十字军圣印"] = 2,
		[19708] = 1,
		["绝望祷言"] = 5,
		["!Autoshot"] = 4,
		["强化断筋"] = 1,
		["心灵专注"] = 5,
		["蝰蛇钉刺"] = 3,
		["荆棘光环"] = "主宰拉姆塔斯",
		["抚慰"] = "动力保安装甲",
		["挑战怒吼"] = 1,
		["驱邪术"] = 2,
		["蛛网"] = "墓穴劫掠者",
		["渐隐术"] = 5,
		["圆弧斩"] = "洞窟劫掠者",
		["眩晕"] = 3,
		["嗜血术"] = "哈姆霍克",
		["缴械"] = "斯尼德 <斯尼德的伐木机>",
		["调节"] = "麻疯技师",
		["快速治疗"] = 5,
		["反手一击"] = "迪菲亚罪犯",
		["召唤骷髅仆从"] = "亡首通灵师",
		["重击"] = 11,
		["魔法抑制"] = 8,
		["增压"] = "麻疯技师",
		["奥术飞弹"] = 8,
		["暗影迷雾"] = "痛苦的死者",
		["自然之握"] = 11,
		["凿击"] = 4,
		["吸取法力"] = 9,
		["撕碎"] = 11,
		["射击"] = 5,
		["制造次级治疗石"] = 9,
		["减速术"] = "血色魔术师",
		["还击"] = 4,
		["造水术"] = 8,
		[20600] = 1,
		["辐射之箭"] = "辐射抢劫者",
		[6673] = 1,
		["霜寒刺骨"] = 8,
		["召唤地狱猎犬"] = 9,
		["消失"] = 4,
		["冰霜新星"] = 8,
		["困兽之爪"] = "噬棘食尸鬼",
		["诅咒之血"] = "腐烂的阿迦玛",
		["灵感"] = 5,
		["驱毒术"] = 11,
		["冰锥术"] = 8,
		["弹出斯尼德"] = "斯尼德的伐木机",
		["回春术"] = 9,
		["速度"] = 8,
		["血之诅咒"] = "阿迦玛甘之血",
		["厚绒线绷带"] = 4,
		["统御意志"] = "拉戈斯诺特",
		["石像形态"] = 5,
		["地狱烈焰效果"] = 9,
		["撕扯"] = 11,
		[7294] = 2,
		["盾墙"] = 1,
		[19835] = 2,
		["火焰之盾效果 III"] = "血色招魂师",
		["伤害增效"] = "骷髅暗影法师 <骷髅召唤者>",
		["辐射"] = "辐射抢劫者",
		["拳击"] = 1,
		["奥术冲击"] = 1,
		["痛苦诅咒"] = 9,
		["解除诅咒"] = 11,
		["次级智力"] = 9,
		["骨甲术"] = "亡首通灵师",
		["吸取生命"] = 9,
		["无荣誉目标"] = 1,
		["再生"] = 3,
		["重拳先生践踏"] = "重拳先生",
		["百万伏特"] = "电刑器6000型",
		["猎豹形态"] = 11,
		["纯净术"] = 2,
		["光明祝福"] = 2,
		["愤怒"] = 11,
		["生命通道"] = 9,
		["复生"] = 11,
		["自由祝福"] = 2,
		["豹群守护"] = 3,
		["喂养宠物"] = 3,
		["冰冻陷阱"] = 3,
		["棕马"] = 1,
		["寒冰屏障"] = 8,
		["自爆"] = "黑铁地雷 <黑铁密探>",
		["辩护"] = 2,
		["冰霜射击"] = "剃刀沼泽驯兽师",
		["虚弱诅咒"] = 9,
		["血袭"] = 11,
		["虔诚光环"] = 2,
		["自律"] = 2,
		["吸取灵魂"] = 9,
		["地狱烈焰"] = 9,
		["恢复生命"] = 9,
		["愤怒之锤"] = 2,
		["圣光术"] = 2,
		["捕捉地狱犬之魂"] = 9,
		["次级治疗术"] = 5,
		["防护暗影"] = 5,
		["制造治疗石"] = 9,
		["扭曲"] = "麻疯技师",
		["挫志咆哮"] = 11,
		["背刺"] = 4,
		["圣疗术"] = 2,
		["次级治疗石"] = 1,
		["深度睡眠"] = "大检察官怀特迈恩",
		["多重射击"] = "风飞殇殃",
		["保护祝福"] = 2,
		["制造初级治疗石"] = 9,
		["腐蚀术"] = 9,
		["祛病术"] = 5,
		["野性印记"] = 11,
		["肾击"] = 4,
		["放置幽灵磁铁"] = 9,
		["佯攻"] = 4,
		[19740] = 2,
		["逃脱"] = 3,
		["召唤幻象之影"] = "鬼魅幻影",
		["枯萎之触"] = "枯萎野猪人守卫",
		["防护暗影结界"] = 9,
		[6756] = 11,
		["魔甲术"] = 9,
		["相位变换"] = "拉普泰 <这我不是乱杀>",
		["精灵之火（野性）"] = 11,
		["召唤野猪之魂"] = "阿格姆",
		["战斗怒吼"] = 1,
		["放逐术"] = 9,
		["盾牌专精"] = 1,
		["制造魔法翡翠"] = 8,
		["猛禽一击"] = 3,
		["大地震颤"] = "剃刀沼泽震地者",
		["黑铁地雷"] = "黑铁密探",
		["诅咒增幅"] = 9,
		["神圣新星"] = 5,
		["假死"] = 3,
		["拦截"] = 1,
		["破胆怒吼"] = 1,
		["厚丝质绷带"] = 8,
		["火焰之盾 III"] = 9,
		["旋风斩"] = 1,
		["语言诅咒"] = 9,
		["顺劈斩"] = 1,
		["烹制甜点"] = "曲奇",
		["挑战咆哮"] = 11,
		[8094] = 2,
		["恶性毒药"] = "墓穴劫掠者",
		["毁灭"] = 11,
		[8118] = 1,
	},
	["encounter_spell_pool"] = {
	},
	["dungeon_data"] = {
	},
	["got_first_run"] = true,
	["report_pos"] = {
		1, -- [1]
		1, -- [2]
	},
	["latest_report_table"] = {
		{
			1, -- [1]
			1, -- [2]
			1, -- [3]
			5, -- [4]
			"PARTY", -- [5]
		}, -- [1]
	},
	["__profiles"] = {
		["苍炎月影-希尔盖"] = {
			["show_arena_role_icon"] = false,
			["capture_real"] = {
				["heal"] = true,
				["spellcast"] = true,
				["miscdata"] = true,
				["aura"] = true,
				["energy"] = true,
				["damage"] = true,
			},
			["row_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["streamer_config"] = {
				["faster_updates"] = false,
				["quick_detection"] = false,
				["reset_spec_cache"] = false,
				["no_alerts"] = false,
				["disable_mythic_dungeon"] = false,
				["use_animation_accel"] = true,
			},
			["all_players_are_group"] = false,
			["use_row_animations"] = true,
			["report_heal_links"] = false,
			["remove_realm_from_name"] = true,
			["minimum_overall_combat_time"] = 10,
			["event_tracker"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["line_height"] = 16,
				["line_color"] = {
					0.1, -- [1]
					0.1, -- [2]
					0.1, -- [3]
					0.3, -- [4]
				},
				["font_shadow"] = "NONE",
				["font_size"] = 10,
				["font_face"] = "Friz Quadrata TT",
				["frame"] = {
					["show_title"] = true,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0.16, -- [1]
						0.16, -- [2]
						0.16, -- [3]
						0.47, -- [4]
					},
					["locked"] = false,
					["height"] = 300,
					["width"] = 250,
				},
				["line_texture"] = "Details Serenity",
				["options_frame"] = {
				},
			},
			["report_to_who"] = "",
			["class_specs_coords"] = {
				[62] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[63] = {
					0.375, -- [1]
					0.5, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[250] = {
					0, -- [1]
					0.125, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[251] = {
					0.125, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[252] = {
					0.25, -- [1]
					0.375, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[253] = {
					0.875, -- [1]
					1, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[254] = {
					0, -- [1]
					0.125, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[255] = {
					0.125, -- [1]
					0.25, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[66] = {
					0.125, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[257] = {
					0.5, -- [1]
					0.625, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[258] = {
					0.6328125, -- [1]
					0.75, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[259] = {
					0.75, -- [1]
					0.875, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[260] = {
					0.875, -- [1]
					1, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[577] = {
					0.25, -- [1]
					0.375, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[262] = {
					0.125, -- [1]
					0.25, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[581] = {
					0.375, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[264] = {
					0.375, -- [1]
					0.5, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[265] = {
					0.5, -- [1]
					0.625, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[266] = {
					0.625, -- [1]
					0.75, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[267] = {
					0.75, -- [1]
					0.875, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[268] = {
					0.625, -- [1]
					0.75, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[269] = {
					0.875, -- [1]
					1, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[270] = {
					0.75, -- [1]
					0.875, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[70] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[102] = {
					0.375, -- [1]
					0.5, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[71] = {
					0.875, -- [1]
					1, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[103] = {
					0.5, -- [1]
					0.625, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[72] = {
					0, -- [1]
					0.125, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[104] = {
					0.625, -- [1]
					0.75, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[73] = {
					0.125, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[64] = {
					0.5, -- [1]
					0.625, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[105] = {
					0.75, -- [1]
					0.875, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[65] = {
					0, -- [1]
					0.125, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[256] = {
					0.375, -- [1]
					0.5, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[261] = {
					0, -- [1]
					0.125, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[263] = {
					0.25, -- [1]
					0.375, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
			},
			["profile_save_pos"] = true,
			["tooltip"] = {
				["header_statusbar"] = {
					0.3, -- [1]
					0.3, -- [2]
					0.3, -- [3]
					0.8, -- [4]
					false, -- [5]
					false, -- [6]
					"WorldState Score", -- [7]
				},
				["fontcolor_right"] = {
					1, -- [1]
					0.7, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["line_height"] = 17,
				["tooltip_max_targets"] = 2,
				["icon_size"] = {
					["W"] = 17,
					["H"] = 17,
				},
				["tooltip_max_pets"] = 2,
				["anchor_relative"] = "top",
				["abbreviation"] = 2,
				["anchored_to"] = 1,
				["show_amount"] = false,
				["header_text_color"] = {
					1, -- [1]
					0.9176, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["fontsize"] = 16,
				["background"] = {
					0.196, -- [1]
					0.196, -- [2]
					0.196, -- [3]
					0.8, -- [4]
				},
				["submenu_wallpaper"] = true,
				["fontsize_title"] = 10,
				["fontcolor"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["commands"] = {
				},
				["tooltip_max_abilities"] = 6,
				["fontface"] = "Friz Quadrata TT",
				["border_color"] = {
					0, -- [1]
					0, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["border_texture"] = "Details BarBorder 3",
				["anchor_offset"] = {
					0, -- [1]
					0, -- [2]
				},
				["menus_bg_texture"] = "Interface\\SPELLBOOK\\Spellbook-Page-1",
				["maximize_method"] = 1,
				["border_size"] = 14,
				["fontshadow"] = false,
				["anchor_screen_pos"] = {
					507.7, -- [1]
					-350.5, -- [2]
				},
				["anchor_point"] = "bottom",
				["menus_bg_coords"] = {
					0.309777336120606, -- [1]
					0.924000015258789, -- [2]
					0.213000011444092, -- [3]
					0.279000015258789, -- [4]
				},
				["icon_border_texcoord"] = {
					["R"] = 0.921875,
					["L"] = 0.078125,
					["T"] = 0.078125,
					["B"] = 0.921875,
				},
				["menus_bg_color"] = {
					0.8, -- [1]
					0.8, -- [2]
					0.8, -- [3]
					0.2, -- [4]
				},
			},
			["ps_abbreviation"] = 3,
			["world_combat_is_trash"] = false,
			["update_speed"] = 0.2,
			["bookmark_text_size"] = 11,
			["animation_speed_mintravel"] = 0.45,
			["track_item_level"] = true,
			["windows_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["instances_menu_click_to_open"] = false,
			["overall_clear_newchallenge"] = true,
			["current_dps_meter"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["arena_enabled"] = true,
				["font_shadow"] = "NONE",
				["font_size"] = 18,
				["mythic_dungeon_enabled"] = true,
				["sample_size"] = 5,
				["font_face"] = "Friz Quadrata TT",
				["frame"] = {
					["show_title"] = false,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0.2, -- [4]
					},
					["locked"] = false,
					["height"] = 65,
					["width"] = 220,
				},
				["update_interval"] = 0.3,
				["options_frame"] = {
				},
			},
			["data_cleanup_logout"] = false,
			["instances_disable_bar_highlight"] = false,
			["trash_concatenate"] = false,
			["color_by_arena_team"] = true,
			["animation_speed"] = 33,
			["disable_stretch_from_toolbar"] = false,
			["disable_lock_ungroup_buttons"] = false,
			["memory_ram"] = 64,
			["disable_window_groups"] = false,
			["instances_suppress_trash"] = 0,
			["options_window"] = {
				["scale"] = 1,
			},
			["animation_speed_maxtravel"] = 3,
			["instances_segments_locked"] = false,
			["deadlog_limit"] = 16,
			["font_faces"] = {
				["menus"] = "Friz Quadrata TT",
			},
			["instances_no_libwindow"] = false,
			["instances"] = {
				{
					["__pos"] = {
						["normal"] = {
							["y"] = -448.500503540039,
							["x"] = 797.501708984375,
							["w"] = 321,
							["h"] = 137.00016784668,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["show_statusbar"] = false,
					["clickthrough_window"] = false,
					["menu_anchor"] = {
						16, -- [1]
						3, -- [2]
						["side"] = 2,
					},
					["bg_r"] = 0.0941176470588235,
					["hide_out_of_combat"] = false,
					["color_buttons"] = {
						1, -- [1]
						1, -- [2]
						1, -- [3]
						1, -- [4]
					},
					["toolbar_icon_file"] = "Interface\\AddOns\\Details\\images\\toolbar_icons",
					["micro_displays_locked"] = true,
					["tooltip"] = {
						["n_abilities"] = 3,
						["n_enemies"] = 3,
					},
					["switch_all_roles_in_combat"] = false,
					["clickthrough_toolbaricons"] = false,
					["attribute_text"] = {
						["enabled"] = true,
						["shadow"] = true,
						["side"] = 1,
						["text_size"] = 13,
						["custom_text"] = "{name}",
						["text_face"] = "Fonts\\ARKai_T.ttf",
						["anchor"] = {
							0, -- [1]
							3, -- [2]
						},
						["show_timer"] = {
							true, -- [1]
							true, -- [2]
							true, -- [3]
						},
						["enable_custom_text"] = false,
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["ignore_mass_showhide"] = false,
					["plugins_grow_direction"] = 1,
					["menu_icons"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						false, -- [6]
						["space"] = -2,
						["shadow"] = false,
					},
					["desaturated_menu"] = true,
					["auto_hide_menu"] = {
						["left"] = false,
						["right"] = false,
					},
					["window_scale"] = 1,
					["hide_icon"] = false,
					["toolbar_side"] = 1,
					["bg_g"] = 0.0941176470588235,
					["bg_b"] = 0.0941176470588235,
					["switch_healer_in_combat"] = false,
					["color"] = {
						0.0705882352941177, -- [1]
						0.0705882352941177, -- [2]
						0.0705882352941177, -- [3]
						0.639196664094925, -- [4]
					},
					["skin"] = "Minimalistic",
					["following"] = {
						["enabled"] = false,
						["bar_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["switch_healer"] = false,
					["StatusBarSaved"] = {
						["center"] = "DETAILS_STATUSBAR_PLUGIN_CLOCK",
						["right"] = "DETAILS_STATUSBAR_PLUGIN_PDPS",
						["options"] = {
							["DETAILS_STATUSBAR_PLUGIN_PDPS"] = {
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["textXMod"] = 0,
								["textFace"] = "Accidental Presidency",
								["textStyle"] = 2,
								["textAlign"] = 0,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
							["DETAILS_STATUSBAR_PLUGIN_THREAT"] = {
								["isHidden"] = false,
								["textStyle"] = 2,
								["textYMod"] = 1,
								["segmentType"] = 2,
								["textFace"] = "Accidental Presidency",
								["textXMod"] = 0,
								["textAlign"] = 0,
								["textSize"] = 10,
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
							},
							["DETAILS_STATUSBAR_PLUGIN_CLOCK"] = {
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["textStyle"] = 2,
								["textFace"] = "Accidental Presidency",
								["textAlign"] = 0,
								["textXMod"] = 6,
								["timeType"] = 1,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
						},
						["left"] = "DETAILS_STATUSBAR_PLUGIN_THREAT",
					},
					["instance_button_anchor"] = {
						-27, -- [1]
						1, -- [2]
					},
					["bg_alpha"] = 0.183960914611816,
					["__snapV"] = true,
					["__locked"] = true,
					["menu_alpha"] = {
						["enabled"] = false,
						["onleave"] = 1,
						["ignorebars"] = false,
						["iconstoo"] = true,
						["onenter"] = 1,
					},
					["__snapH"] = false,
					["hide_in_combat_type"] = 1,
					["__was_opened"] = true,
					["strata"] = "LOW",
					["clickthrough_incombatonly"] = true,
					["__snap"] = {
						[4] = 2,
					},
					["menu_icons_size"] = 1,
					["hide_in_combat_alpha"] = 0,
					["menu_anchor_down"] = {
						16, -- [1]
						-3, -- [2]
					},
					["grab_on_top"] = false,
					["libwindow"] = {
						["y"] = 23.00026512146,
						["x"] = -1.9998779296875,
						["point"] = "BOTTOMRIGHT",
						["scale"] = 1,
					},
					["statusbar_info"] = {
						["alpha"] = 0.3777777777777,
						["overlay"] = {
							0.333333333333333, -- [1]
							0.333333333333333, -- [2]
							0.333333333333333, -- [3]
						},
					},
					["switch_tank_in_combat"] = false,
					["bars_grow_direction"] = 1,
					["micro_displays_side"] = 2,
					["bars_sort_direction"] = 1,
					["total_bar"] = {
						["enabled"] = false,
						["only_in_group"] = true,
						["icon"] = "Interface\\ICONS\\INV_Sigil_Thorim",
						["color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["switch_damager_in_combat"] = false,
					["backdrop_texture"] = "None",
					["show_sidebars"] = false,
					["auto_current"] = true,
					["row_show_animation"] = {
						["anim"] = "Fade",
						["options"] = {
						},
					},
					["version"] = 3,
					["clickthrough_rows"] = false,
					["hide_in_combat"] = false,
					["posicao"] = {
						["normal"] = {
							["y"] = -448.500503540039,
							["x"] = 797.501708984375,
							["w"] = 321,
							["h"] = 137.00016784668,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["switch_damager"] = false,
					["switch_all_roles_after_wipe"] = false,
					["wallpaper"] = {
						["enabled"] = false,
						["texcoord"] = {
							0, -- [1]
							1, -- [2]
							0, -- [3]
							0.7, -- [4]
						},
						["overlay"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["anchor"] = "all",
						["height"] = 114.042518615723,
						["alpha"] = 0.5,
						["width"] = 283.000183105469,
					},
					["stretch_button_side"] = 1,
					["switch_tank"] = false,
					["row_info"] = {
						["textR_outline"] = true,
						["spec_file"] = "Interface\\AddOns\\Details\\images\\spec_icons_normal",
						["textL_outline"] = true,
						["texture_highlight"] = "Interface\\FriendsFrame\\UI-FriendsList-Highlight",
						["textR_show_data"] = {
							true, -- [1]
							true, -- [2]
							false, -- [3]
						},
						["percent_type"] = 1,
						["fixed_text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["space"] = {
							["right"] = 0,
							["left"] = 0,
							["between"] = 1,
						},
						["texture_background_class_color"] = false,
						["textL_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["font_face_file"] = "Fonts\\ARKai_T.ttf",
						["backdrop"] = {
							["enabled"] = false,
							["texture"] = "Details BarBorder 2",
							["color"] = {
								1, -- [1]
								1, -- [2]
								1, -- [3]
								1, -- [4]
							},
							["size"] = 12,
						},
						["models"] = {
							["upper_model"] = "Spells\\AcidBreath_SuperGreen.M2",
							["lower_model"] = "World\\EXPANSION02\\DOODADS\\Coldarra\\COLDARRALOCUS.m2",
							["upper_alpha"] = 0.5,
							["lower_enabled"] = false,
							["lower_alpha"] = 0.1,
							["upper_enabled"] = false,
						},
						["height"] = 18,
						["texture_file"] = "Interface\\AddOns\\Details\\images\\BantoBar",
						["texture_custom_file"] = "Interface\\",
						["font_size"] = 13,
						["icon_file"] = "Interface\\AddOns\\Details\\images\\classes_small",
						["icon_grayscale"] = false,
						["textL_custom_text"] = "{data1}. {data3}{data2}",
						["use_spec_icons"] = true,
						["texture_custom"] = "",
						["texture"] = "BantoBar",
						["fixed_texture_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
						},
						["textL_show_number"] = true,
						["textL_enable_custom_text"] = false,
						["textL_outline_small"] = false,
						["textR_custom_text"] = "{data1} ({data2}, {data3}%)",
						["fixed_texture_background_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							0.150228589773178, -- [4]
						},
						["textR_enable_custom_text"] = false,
						["texture_background_file"] = "Interface\\AddOns\\Details\\images\\bar4_reverse",
						["textL_class_colors"] = false,
						["alpha"] = 1,
						["texture_background"] = "Details D'ictum (reverse)",
						["textR_class_colors"] = false,
						["textR_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["no_icon"] = false,
						["icon_offset"] = {
							0, -- [1]
							0, -- [2]
						},
						["textR_outline_small"] = false,
						["font_face"] = "Fonts\\ARKai_T.ttf",
						["texture_class_colors"] = true,
						["start_after_icon"] = true,
						["fast_ps_update"] = false,
						["textR_separator"] = "NONE",
						["textR_bracket"] = "(",
					},
					["skin_custom"] = "",
					["bars_inverted"] = false,
				}, -- [1]
				{
					["__pos"] = {
						["normal"] = {
							["y"] = -291.500350952148,
							["x"] = 797.501708984375,
							["w"] = 321,
							["h"] = 137.00016784668,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["show_statusbar"] = false,
					["clickthrough_window"] = false,
					["menu_anchor"] = {
						16, -- [1]
						3, -- [2]
						["side"] = 2,
					},
					["bg_r"] = 0.0941176470588235,
					["hide_out_of_combat"] = false,
					["color_buttons"] = {
						1, -- [1]
						1, -- [2]
						1, -- [3]
						1, -- [4]
					},
					["toolbar_icon_file"] = "Interface\\AddOns\\Details\\images\\toolbar_icons",
					["micro_displays_locked"] = true,
					["tooltip"] = {
						["n_abilities"] = 3,
						["n_enemies"] = 3,
					},
					["switch_all_roles_in_combat"] = false,
					["clickthrough_toolbaricons"] = false,
					["attribute_text"] = {
						["enabled"] = true,
						["shadow"] = true,
						["side"] = 1,
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["custom_text"] = "{name}",
						["text_face"] = "Fonts\\ARKai_T.ttf",
						["anchor"] = {
							0, -- [1]
							3, -- [2]
						},
						["text_size"] = 13,
						["enable_custom_text"] = false,
						["show_timer"] = {
							true, -- [1]
							true, -- [2]
							true, -- [3]
						},
					},
					["ignore_mass_showhide"] = false,
					["plugins_grow_direction"] = 1,
					["menu_icons"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						false, -- [6]
						["space"] = -2,
						["shadow"] = false,
					},
					["desaturated_menu"] = true,
					["auto_hide_menu"] = {
						["left"] = false,
						["right"] = false,
					},
					["window_scale"] = 1,
					["hide_icon"] = false,
					["toolbar_side"] = 1,
					["bg_g"] = 0.0941176470588235,
					["bg_b"] = 0.0941176470588235,
					["switch_healer_in_combat"] = false,
					["color"] = {
						0.0705882352941177, -- [1]
						0.0705882352941177, -- [2]
						0.0705882352941177, -- [3]
						0.639196664094925, -- [4]
					},
					["skin"] = "Minimalistic",
					["following"] = {
						["bar_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["enabled"] = false,
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["switch_healer"] = false,
					["StatusBarSaved"] = {
						["center"] = "DETAILS_STATUSBAR_PLUGIN_CLOCK",
						["right"] = "DETAILS_STATUSBAR_PLUGIN_PDPS",
						["options"] = {
							["DETAILS_STATUSBAR_PLUGIN_PDPS"] = {
								["textYMod"] = 1,
								["textXMod"] = 0,
								["textFace"] = "Accidental Presidency",
								["textAlign"] = 0,
								["textStyle"] = 2,
								["textSize"] = 10,
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
							},
							["DETAILS_STATUSBAR_PLUGIN_PSEGMENT"] = {
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["segmentType"] = 2,
								["textFace"] = "Accidental Presidency",
								["textXMod"] = 0,
								["textAlign"] = 0,
								["textStyle"] = 2,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
							["DETAILS_STATUSBAR_PLUGIN_CLOCK"] = {
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["textFace"] = "Accidental Presidency",
								["textXMod"] = 6,
								["textAlign"] = 0,
								["timeType"] = 1,
								["textStyle"] = 2,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
						},
						["left"] = "DETAILS_STATUSBAR_PLUGIN_PSEGMENT",
					},
					["instance_button_anchor"] = {
						-27, -- [1]
						1, -- [2]
					},
					["bg_alpha"] = 0.183960914611816,
					["__snapV"] = true,
					["__locked"] = true,
					["menu_alpha"] = {
						["enabled"] = false,
						["onenter"] = 1,
						["iconstoo"] = true,
						["ignorebars"] = false,
						["onleave"] = 1,
					},
					["__snapH"] = false,
					["hide_in_combat_type"] = 1,
					["__was_opened"] = true,
					["strata"] = "LOW",
					["clickthrough_incombatonly"] = true,
					["__snap"] = {
						[2] = 1,
					},
					["menu_icons_size"] = 1,
					["hide_in_combat_alpha"] = 0,
					["menu_anchor_down"] = {
						16, -- [1]
						-3, -- [2]
					},
					["grab_on_top"] = false,
					["libwindow"] = {
						["y"] = 180.000427246094,
						["x"] = -1.9998779296875,
						["point"] = "BOTTOMRIGHT",
						["scale"] = 1,
					},
					["statusbar_info"] = {
						["alpha"] = 0.3777777777777,
						["overlay"] = {
							0.333333333333333, -- [1]
							0.333333333333333, -- [2]
							0.333333333333333, -- [3]
						},
					},
					["switch_tank_in_combat"] = false,
					["bars_grow_direction"] = 1,
					["micro_displays_side"] = 2,
					["bars_sort_direction"] = 1,
					["total_bar"] = {
						["enabled"] = false,
						["only_in_group"] = true,
						["icon"] = "Interface\\ICONS\\INV_Sigil_Thorim",
						["color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["switch_damager_in_combat"] = false,
					["backdrop_texture"] = "None",
					["show_sidebars"] = false,
					["auto_current"] = true,
					["row_show_animation"] = {
						["anim"] = "Fade",
						["options"] = {
						},
					},
					["version"] = 3,
					["clickthrough_rows"] = false,
					["hide_in_combat"] = false,
					["posicao"] = {
						["normal"] = {
							["y"] = -291.500350952148,
							["x"] = 797.501708984375,
							["w"] = 321,
							["h"] = 137.00016784668,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["switch_damager"] = false,
					["switch_all_roles_after_wipe"] = false,
					["wallpaper"] = {
						["overlay"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["texcoord"] = {
							0, -- [1]
							1, -- [2]
							0, -- [3]
							0.7, -- [4]
						},
						["enabled"] = false,
						["anchor"] = "all",
						["height"] = 114.042518615723,
						["alpha"] = 0.5,
						["width"] = 283.000183105469,
					},
					["stretch_button_side"] = 1,
					["switch_tank"] = false,
					["row_info"] = {
						["textR_outline"] = true,
						["spec_file"] = "Interface\\AddOns\\Details\\images\\spec_icons_normal",
						["textL_outline"] = true,
						["textR_outline_small"] = false,
						["textL_outline_small"] = false,
						["percent_type"] = 1,
						["fixed_text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["space"] = {
							["right"] = 0,
							["left"] = 0,
							["between"] = 1,
						},
						["texture_background_class_color"] = false,
						["start_after_icon"] = true,
						["font_face_file"] = "Fonts\\ARKai_T.ttf",
						["textL_custom_text"] = "{data1}. {data3}{data2}",
						["models"] = {
							["upper_model"] = "Spells\\AcidBreath_SuperGreen.M2",
							["lower_model"] = "World\\EXPANSION02\\DOODADS\\Coldarra\\COLDARRALOCUS.m2",
							["upper_alpha"] = 0.5,
							["lower_enabled"] = false,
							["lower_alpha"] = 0.1,
							["upper_enabled"] = false,
						},
						["height"] = 18,
						["texture_file"] = "Interface\\AddOns\\Details\\images\\BantoBar",
						["use_spec_icons"] = true,
						["font_size"] = 13,
						["icon_file"] = "Interface\\AddOns\\Details\\images\\classes_small",
						["icon_grayscale"] = false,
						["backdrop"] = {
							["enabled"] = false,
							["size"] = 12,
							["color"] = {
								1, -- [1]
								1, -- [2]
								1, -- [3]
								1, -- [4]
							},
							["texture"] = "Details BarBorder 2",
						},
						["textR_bracket"] = "(",
						["texture_custom"] = "",
						["texture"] = "BantoBar",
						["fixed_texture_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
						},
						["textL_show_number"] = true,
						["textL_enable_custom_text"] = false,
						["textR_show_data"] = {
							true, -- [1]
							true, -- [2]
							false, -- [3]
						},
						["textR_custom_text"] = "{data1} ({data2}, {data3}%)",
						["fixed_texture_background_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							0.150228589773178, -- [4]
						},
						["texture_highlight"] = "Interface\\FriendsFrame\\UI-FriendsList-Highlight",
						["texture_background_file"] = "Interface\\AddOns\\Details\\images\\bar4_reverse",
						["texture_background"] = "Details D'ictum (reverse)",
						["textR_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["textR_class_colors"] = false,
						["textL_class_colors"] = false,
						["alpha"] = 1,
						["no_icon"] = false,
						["icon_offset"] = {
							0, -- [1]
							0, -- [2]
						},
						["textR_enable_custom_text"] = false,
						["font_face"] = "Fonts\\ARKai_T.ttf",
						["texture_class_colors"] = true,
						["textL_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["fast_ps_update"] = false,
						["textR_separator"] = "NONE",
						["texture_custom_file"] = "Interface\\",
					},
					["skin_custom"] = "",
					["bars_inverted"] = false,
				}, -- [2]
			},
			["data_broker_text"] = "",
			["segments_amount"] = 18,
			["report_lines"] = 5,
			["clear_ungrouped"] = true,
			["use_battleground_server_parser"] = false,
			["skin"] = "WoW Interface",
			["override_spellids"] = true,
			["use_scroll"] = false,
			["report_schema"] = 1,
			["overall_clear_newboss"] = true,
			["overall_clear_logout"] = false,
			["minimum_combat_time"] = 5,
			["font_sizes"] = {
				["menus"] = 15,
			},
			["cloud_capture"] = true,
			["damage_taken_everything"] = false,
			["scroll_speed"] = 2,
			["new_window_size"] = {
				["height"] = 158,
				["width"] = 310,
			},
			["chat_tab_embed"] = {
				["enabled"] = false,
				["y_offset"] = 0,
				["x_offset"] = 0,
				["tab_name"] = "",
				["single_window"] = false,
			},
			["deadlog_events"] = 32,
			["window_clamp"] = {
				-8, -- [1]
				0, -- [2]
				21, -- [3]
				-14, -- [4]
			},
			["close_shields"] = false,
			["class_coords"] = {
				["HUNTER"] = {
					0, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["WARRIOR"] = {
					0, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["SHAMAN"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["MAGE"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["PET"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["DRUID"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["MONK"] = {
					0.5, -- [1]
					0.73828125, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["DEATHKNIGHT"] = {
					0.25, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["ENEMY"] = {
					0, -- [1]
					0.25, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["UNKNOW"] = {
					0.5, -- [1]
					0.75, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["PRIEST"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["UNGROUPPLAYER"] = {
					0.5, -- [1]
					0.75, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["Alliance"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["WARLOCK"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["DEMONHUNTER"] = {
					0.73828126, -- [1]
					1, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["Horde"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["PALADIN"] = {
					0, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["ROGUE"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["MONSTER"] = {
					0, -- [1]
					0.25, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
			},
			["windows_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["disable_alldisplays_window"] = false,
			["standard_skin"] = false,
			["hotcorner_topleft"] = {
				["hide"] = false,
			},
			["trash_auto_remove"] = true,
			["animation_speed_triggertravel"] = 5,
			["clear_graphic"] = true,
			["class_colors"] = {
				["HUNTER"] = {
					0.67, -- [1]
					0.83, -- [2]
					0.45, -- [3]
				},
				["WARRIOR"] = {
					0.78, -- [1]
					0.61, -- [2]
					0.43, -- [3]
				},
				["ROGUE"] = {
					1, -- [1]
					0.96, -- [2]
					0.41, -- [3]
				},
				["MAGE"] = {
					0.41, -- [1]
					0.8, -- [2]
					0.94, -- [3]
				},
				["ARENA_YELLOW"] = {
					1, -- [1]
					1, -- [2]
					0.25, -- [3]
				},
				["UNGROUPPLAYER"] = {
					0.4, -- [1]
					0.4, -- [2]
					0.4, -- [3]
				},
				["DRUID"] = {
					1, -- [1]
					0.49, -- [2]
					0.04, -- [3]
				},
				["MONK"] = {
					0, -- [1]
					1, -- [2]
					0.59, -- [3]
				},
				["DEATHKNIGHT"] = {
					0.77, -- [1]
					0.12, -- [2]
					0.23, -- [3]
				},
				["PET"] = {
					0.3, -- [1]
					0.4, -- [2]
					0.5, -- [3]
				},
				["UNKNOW"] = {
					0.2, -- [1]
					0.2, -- [2]
					0.2, -- [3]
				},
				["PRIEST"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
				},
				["ENEMY"] = {
					0.94117, -- [1]
					0, -- [2]
					0.0196, -- [3]
					1, -- [4]
				},
				["SHAMAN"] = {
					0, -- [1]
					0.44, -- [2]
					0.87, -- [3]
				},
				["WARLOCK"] = {
					0.58, -- [1]
					0.51, -- [2]
					0.79, -- [3]
				},
				["DEMONHUNTER"] = {
					0.64, -- [1]
					0.19, -- [2]
					0.79, -- [3]
				},
				["version"] = 1,
				["NEUTRAL"] = {
					1, -- [1]
					1, -- [2]
					0, -- [3]
				},
				["PALADIN"] = {
					0.96, -- [1]
					0.55, -- [2]
					0.73, -- [3]
				},
				["ARENA_GREEN"] = {
					0.4, -- [1]
					1, -- [2]
					0.4, -- [3]
				},
			},
			["segments_auto_erase"] = 1,
			["options_group_edit"] = true,
			["broadcaster_enabled"] = false,
			["minimap"] = {
				["onclick_what_todo"] = 1,
				["radius"] = 160,
				["hide"] = false,
				["minimapPos"] = 220,
				["text_format"] = 3,
				["text_type"] = 1,
			},
			["instances_amount"] = 5,
			["max_window_size"] = {
				["height"] = 450,
				["width"] = 480,
			},
			["deny_score_messages"] = false,
			["only_pvp_frags"] = false,
			["disable_stretch_button"] = false,
			["default_bg_color"] = 0.0941,
			["segments_amount_to_save"] = 18,
			["total_abbreviation"] = 2,
			["segments_panic_mode"] = false,
			["numerical_system_symbols"] = "auto",
			["overall_flag"] = 16,
			["row_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["memory_threshold"] = 3,
			["player_details_window"] = {
				["scale"] = 1,
				["skin"] = "ElvUI",
				["bar_texture"] = "Skyline",
			},
			["numerical_system"] = 1,
			["force_activity_time_pvp"] = true,
			["pvp_as_group"] = true,
			["class_icons_small"] = "Interface\\AddOns\\Details\\images\\classes_small",
			["disable_reset_button"] = false,
			["animate_scroll"] = false,
			["death_tooltip_width"] = 350,
			["time_type"] = 2,
			["default_bg_alpha"] = 0.5,
			["time_type_original"] = 2,
		},
		["苍炎月影-德姆塞卡尔"] = {
			["show_arena_role_icon"] = false,
			["capture_real"] = {
				["heal"] = true,
				["spellcast"] = true,
				["miscdata"] = true,
				["aura"] = true,
				["energy"] = true,
				["damage"] = true,
			},
			["row_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["streamer_config"] = {
				["faster_updates"] = false,
				["quick_detection"] = false,
				["reset_spec_cache"] = false,
				["no_alerts"] = false,
				["disable_mythic_dungeon"] = false,
				["use_animation_accel"] = true,
			},
			["all_players_are_group"] = false,
			["use_row_animations"] = true,
			["report_heal_links"] = false,
			["remove_realm_from_name"] = true,
			["minimum_overall_combat_time"] = 10,
			["event_tracker"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["line_height"] = 16,
				["line_color"] = {
					0.1, -- [1]
					0.1, -- [2]
					0.1, -- [3]
					0.3, -- [4]
				},
				["font_shadow"] = "NONE",
				["font_size"] = 10,
				["font_face"] = "Friz Quadrata TT",
				["frame"] = {
					["show_title"] = true,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0.16, -- [1]
						0.16, -- [2]
						0.16, -- [3]
						0.47, -- [4]
					},
					["locked"] = false,
					["height"] = 300,
					["width"] = 250,
				},
				["line_texture"] = "Details Serenity",
				["options_frame"] = {
				},
			},
			["report_to_who"] = "",
			["class_specs_coords"] = {
				[62] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[63] = {
					0.375, -- [1]
					0.5, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[250] = {
					0, -- [1]
					0.125, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[251] = {
					0.125, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[252] = {
					0.25, -- [1]
					0.375, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[253] = {
					0.875, -- [1]
					1, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[254] = {
					0, -- [1]
					0.125, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[255] = {
					0.125, -- [1]
					0.25, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[66] = {
					0.125, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[257] = {
					0.5, -- [1]
					0.625, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[258] = {
					0.6328125, -- [1]
					0.75, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[259] = {
					0.75, -- [1]
					0.875, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[260] = {
					0.875, -- [1]
					1, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[577] = {
					0.25, -- [1]
					0.375, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[262] = {
					0.125, -- [1]
					0.25, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[581] = {
					0.375, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[264] = {
					0.375, -- [1]
					0.5, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[265] = {
					0.5, -- [1]
					0.625, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[266] = {
					0.625, -- [1]
					0.75, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[267] = {
					0.75, -- [1]
					0.875, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[268] = {
					0.625, -- [1]
					0.75, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[269] = {
					0.875, -- [1]
					1, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[270] = {
					0.75, -- [1]
					0.875, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[70] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[102] = {
					0.375, -- [1]
					0.5, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[71] = {
					0.875, -- [1]
					1, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[103] = {
					0.5, -- [1]
					0.625, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[72] = {
					0, -- [1]
					0.125, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[104] = {
					0.625, -- [1]
					0.75, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[73] = {
					0.125, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[263] = {
					0.25, -- [1]
					0.375, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[105] = {
					0.75, -- [1]
					0.875, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[261] = {
					0, -- [1]
					0.125, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[256] = {
					0.375, -- [1]
					0.5, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[65] = {
					0, -- [1]
					0.125, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[64] = {
					0.5, -- [1]
					0.625, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
			},
			["profile_save_pos"] = true,
			["tooltip"] = {
				["header_statusbar"] = {
					0.3, -- [1]
					0.3, -- [2]
					0.3, -- [3]
					0.8, -- [4]
					false, -- [5]
					false, -- [6]
					"WorldState Score", -- [7]
				},
				["fontcolor_right"] = {
					1, -- [1]
					0.7, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["line_height"] = 17,
				["tooltip_max_targets"] = 2,
				["icon_size"] = {
					["W"] = 13,
					["H"] = 13,
				},
				["tooltip_max_pets"] = 2,
				["anchor_relative"] = "top",
				["abbreviation"] = 2,
				["anchored_to"] = 1,
				["show_amount"] = false,
				["header_text_color"] = {
					1, -- [1]
					0.9176, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["fontsize"] = 10,
				["background"] = {
					0.196, -- [1]
					0.196, -- [2]
					0.196, -- [3]
					0.8697, -- [4]
				},
				["submenu_wallpaper"] = true,
				["fontsize_title"] = 10,
				["fontcolor"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["commands"] = {
				},
				["tooltip_max_abilities"] = 6,
				["fontface"] = "Friz Quadrata TT",
				["border_color"] = {
					0, -- [1]
					0, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["border_texture"] = "Details BarBorder 3",
				["anchor_offset"] = {
					0, -- [1]
					0, -- [2]
				},
				["maximize_method"] = 1,
				["fontshadow"] = false,
				["border_size"] = 14,
				["menus_bg_texture"] = "Interface\\SPELLBOOK\\Spellbook-Page-1",
				["anchor_screen_pos"] = {
					507.7, -- [1]
					-350.5, -- [2]
				},
				["anchor_point"] = "bottom",
				["menus_bg_coords"] = {
					0.309777336120606, -- [1]
					0.924000015258789, -- [2]
					0.213000011444092, -- [3]
					0.279000015258789, -- [4]
				},
				["icon_border_texcoord"] = {
					["R"] = 0.921875,
					["L"] = 0.078125,
					["T"] = 0.078125,
					["B"] = 0.921875,
				},
				["menus_bg_color"] = {
					0.8, -- [1]
					0.8, -- [2]
					0.8, -- [3]
					0.2, -- [4]
				},
			},
			["ps_abbreviation"] = 3,
			["world_combat_is_trash"] = false,
			["update_speed"] = 0.2,
			["bookmark_text_size"] = 11,
			["animation_speed_mintravel"] = 0.45,
			["track_item_level"] = true,
			["windows_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["instances_menu_click_to_open"] = false,
			["overall_clear_newchallenge"] = true,
			["current_dps_meter"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["arena_enabled"] = true,
				["font_shadow"] = "NONE",
				["font_size"] = 18,
				["mythic_dungeon_enabled"] = true,
				["sample_size"] = 5,
				["font_face"] = "Friz Quadrata TT",
				["frame"] = {
					["show_title"] = false,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0.2, -- [4]
					},
					["locked"] = false,
					["height"] = 65,
					["width"] = 220,
				},
				["update_interval"] = 0.3,
				["options_frame"] = {
				},
			},
			["data_cleanup_logout"] = false,
			["instances_disable_bar_highlight"] = false,
			["trash_concatenate"] = false,
			["color_by_arena_team"] = true,
			["animation_speed"] = 33,
			["disable_stretch_from_toolbar"] = false,
			["disable_lock_ungroup_buttons"] = false,
			["memory_ram"] = 64,
			["disable_window_groups"] = false,
			["instances_suppress_trash"] = 0,
			["options_window"] = {
				["scale"] = 1,
			},
			["animation_speed_maxtravel"] = 3,
			["instances_segments_locked"] = false,
			["deadlog_limit"] = 16,
			["font_faces"] = {
				["menus"] = "Friz Quadrata TT",
			},
			["instances_no_libwindow"] = false,
			["segments_amount"] = 18,
			["data_broker_text"] = "",
			["instances"] = {
				{
					["__pos"] = {
						["normal"] = {
							["y"] = -420.000762939453,
							["x"] = 797.001831054688,
							["w"] = 320,
							["h"] = 190.000030517578,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["show_statusbar"] = false,
					["clickthrough_window"] = false,
					["menu_anchor"] = {
						16, -- [1]
						3, -- [2]
						["side"] = 2,
					},
					["bg_r"] = 0.0941176470588235,
					["hide_out_of_combat"] = false,
					["color_buttons"] = {
						1, -- [1]
						1, -- [2]
						1, -- [3]
						1, -- [4]
					},
					["toolbar_icon_file"] = "Interface\\AddOns\\Details\\images\\toolbar_icons",
					["bars_sort_direction"] = 1,
					["tooltip"] = {
						["n_abilities"] = 3,
						["n_enemies"] = 3,
					},
					["switch_all_roles_in_combat"] = false,
					["clickthrough_toolbaricons"] = false,
					["clickthrough_rows"] = false,
					["switch_tank"] = false,
					["plugins_grow_direction"] = 1,
					["menu_icons"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						false, -- [6]
						["space"] = -2,
						["shadow"] = false,
					},
					["switch_damager"] = false,
					["show_sidebars"] = false,
					["window_scale"] = 1,
					["hide_icon"] = false,
					["toolbar_side"] = 1,
					["bg_g"] = 0.0941176470588235,
					["bg_b"] = 0.0941176470588235,
					["switch_healer_in_combat"] = false,
					["color"] = {
						0.0705882352941177, -- [1]
						0.0705882352941177, -- [2]
						0.0705882352941177, -- [3]
						0.639196664094925, -- [4]
					},
					["skin"] = "Minimalistic",
					["following"] = {
						["enabled"] = false,
						["bar_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["switch_healer"] = false,
					["StatusBarSaved"] = {
						["left"] = "DETAILS_STATUSBAR_PLUGIN_PSEGMENT",
						["right"] = "DETAILS_STATUSBAR_PLUGIN_PDPS",
						["center"] = "DETAILS_STATUSBAR_PLUGIN_CLOCK",
						["options"] = {
							["DETAILS_STATUSBAR_PLUGIN_PDPS"] = {
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["textXMod"] = 0,
								["textFace"] = "Accidental Presidency",
								["textStyle"] = 2,
								["textAlign"] = 0,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
							["DETAILS_STATUSBAR_PLUGIN_PSEGMENT"] = {
								["textYMod"] = 1,
								["segmentType"] = 2,
								["textFace"] = "Accidental Presidency",
								["textXMod"] = 0,
								["textStyle"] = 2,
								["textAlign"] = 0,
								["textSize"] = 10,
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
							},
							["DETAILS_STATUSBAR_PLUGIN_CLOCK"] = {
								["textYMod"] = 1,
								["textFace"] = "Accidental Presidency",
								["textXMod"] = 6,
								["timeType"] = 1,
								["textStyle"] = 2,
								["textAlign"] = 0,
								["textSize"] = 10,
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
							},
						},
					},
					["instance_button_anchor"] = {
						-27, -- [1]
						1, -- [2]
					},
					["bg_alpha"] = 0.183960914611816,
					["__locked"] = true,
					["menu_alpha"] = {
						["enabled"] = false,
						["onleave"] = 1,
						["ignorebars"] = false,
						["iconstoo"] = true,
						["onenter"] = 1,
					},
					["auto_hide_menu"] = {
						["left"] = false,
						["right"] = false,
					},
					["desaturated_menu"] = true,
					["strata"] = "LOW",
					["clickthrough_incombatonly"] = true,
					["__snap"] = {
					},
					["switch_all_roles_after_wipe"] = false,
					["hide_in_combat_alpha"] = 0,
					["ignore_mass_showhide"] = false,
					["stretch_button_side"] = 1,
					["libwindow"] = {
						["y"] = 25.0000782012939,
						["x"] = -2.9998779296875,
						["point"] = "BOTTOMRIGHT",
						["scale"] = 1,
					},
					["statusbar_info"] = {
						["alpha"] = 0.3777777777777,
						["overlay"] = {
							0.333333333333333, -- [1]
							0.333333333333333, -- [2]
							0.333333333333333, -- [3]
						},
					},
					["skin_custom"] = "",
					["row_show_animation"] = {
						["anim"] = "Fade",
						["options"] = {
						},
					},
					["micro_displays_side"] = 2,
					["bars_grow_direction"] = 1,
					["switch_damager_in_combat"] = false,
					["grab_on_top"] = false,
					["version"] = 3,
					["bars_inverted"] = false,
					["auto_current"] = true,
					["row_info"] = {
						["textR_outline"] = true,
						["spec_file"] = "Interface\\AddOns\\Details\\images\\spec_icons_normal",
						["textL_outline"] = true,
						["texture_highlight"] = "Interface\\FriendsFrame\\UI-FriendsList-Highlight",
						["textR_show_data"] = {
							true, -- [1]
							true, -- [2]
							false, -- [3]
						},
						["textL_enable_custom_text"] = false,
						["fixed_text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["space"] = {
							["right"] = 0,
							["left"] = 0,
							["between"] = 1,
						},
						["texture_background_class_color"] = false,
						["start_after_icon"] = true,
						["font_face_file"] = "Fonts\\ARKai_T.ttf",
						["backdrop"] = {
							["enabled"] = false,
							["texture"] = "Details BarBorder 2",
							["color"] = {
								1, -- [1]
								1, -- [2]
								1, -- [3]
								1, -- [4]
							},
							["size"] = 12,
						},
						["font_size"] = 13,
						["height"] = 18,
						["texture_file"] = "Interface\\Addons\\NDui\\Media\\Armory",
						["texture_custom_file"] = "Interface\\",
						["textL_custom_text"] = "{data1}. {data3}{data2}",
						["icon_file"] = "Interface\\AddOns\\Details\\images\\classes_small",
						["icon_grayscale"] = false,
						["use_spec_icons"] = true,
						["textR_bracket"] = "(",
						["texture_custom"] = "",
						["textL_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["fixed_texture_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
						},
						["textL_show_number"] = true,
						["textL_outline_small"] = false,
						["texture"] = "normTex",
						["textR_custom_text"] = "{data1} ({data2}, {data3}%)",
						["fixed_texture_background_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							0.150228589773178, -- [4]
						},
						["textR_enable_custom_text"] = false,
						["texture_background_file"] = "Interface\\AddOns\\Details\\images\\bar4_reverse",
						["texture_background"] = "Details D'ictum (reverse)",
						["alpha"] = 1,
						["textR_class_colors"] = false,
						["textL_class_colors"] = false,
						["textR_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["no_icon"] = false,
						["icon_offset"] = {
							0, -- [1]
							0, -- [2]
						},
						["textR_outline_small"] = false,
						["font_face"] = "Fonts\\ARKai_T.ttf",
						["texture_class_colors"] = true,
						["percent_type"] = 1,
						["fast_ps_update"] = false,
						["textR_separator"] = "NONE",
						["models"] = {
							["upper_model"] = "Spells\\AcidBreath_SuperGreen.M2",
							["lower_model"] = "World\\EXPANSION02\\DOODADS\\Coldarra\\COLDARRALOCUS.m2",
							["upper_alpha"] = 0.5,
							["lower_enabled"] = false,
							["lower_alpha"] = 0.1,
							["upper_enabled"] = false,
						},
					},
					["menu_anchor_down"] = {
						16, -- [1]
						-3, -- [2]
					},
					["attribute_text"] = {
						["enabled"] = true,
						["shadow"] = true,
						["side"] = 1,
						["text_size"] = 13,
						["custom_text"] = "{name}",
						["text_face"] = "Fonts\\ARKai_T.ttf",
						["anchor"] = {
							0, -- [1]
							3, -- [2]
						},
						["show_timer"] = {
							true, -- [1]
							true, -- [2]
							true, -- [3]
						},
						["enable_custom_text"] = false,
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["hide_in_combat"] = false,
					["posicao"] = {
						["normal"] = {
							["y"] = -420.000762939453,
							["x"] = 797.001831054688,
							["w"] = 320,
							["h"] = 190.000030517578,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["switch_tank_in_combat"] = false,
					["backdrop_texture"] = "None",
					["wallpaper"] = {
						["enabled"] = false,
						["texcoord"] = {
							0, -- [1]
							1, -- [2]
							0, -- [3]
							0.7, -- [4]
						},
						["overlay"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["anchor"] = "all",
						["height"] = 114.042518615723,
						["alpha"] = 0.5,
						["width"] = 283.000183105469,
					},
					["total_bar"] = {
						["enabled"] = false,
						["only_in_group"] = true,
						["icon"] = "Interface\\ICONS\\INV_Sigil_Thorim",
						["color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["micro_displays_locked"] = true,
					["menu_icons_size"] = 1,
					["__was_opened"] = true,
					["hide_in_combat_type"] = 1,
				}, -- [1]
			},
			["report_lines"] = 5,
			["clear_ungrouped"] = true,
			["use_battleground_server_parser"] = false,
			["skin"] = "WoW Interface",
			["override_spellids"] = true,
			["use_scroll"] = false,
			["report_schema"] = 1,
			["overall_clear_newboss"] = true,
			["minimum_combat_time"] = 5,
			["overall_clear_logout"] = false,
			["new_window_size"] = {
				["height"] = 158,
				["width"] = 310,
			},
			["cloud_capture"] = true,
			["damage_taken_everything"] = false,
			["scroll_speed"] = 2,
			["font_sizes"] = {
				["menus"] = 10,
			},
			["memory_threshold"] = 3,
			["deadlog_events"] = 32,
			["window_clamp"] = {
				-8, -- [1]
				0, -- [2]
				21, -- [3]
				-14, -- [4]
			},
			["close_shields"] = false,
			["class_coords"] = {
				["HUNTER"] = {
					0, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["WARRIOR"] = {
					0, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["SHAMAN"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["MAGE"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["PET"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["DRUID"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["MONK"] = {
					0.5, -- [1]
					0.73828125, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["DEATHKNIGHT"] = {
					0.25, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["UNGROUPPLAYER"] = {
					0.5, -- [1]
					0.75, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["UNKNOW"] = {
					0.5, -- [1]
					0.75, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["PRIEST"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["WARLOCK"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["Alliance"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["ENEMY"] = {
					0, -- [1]
					0.25, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["DEMONHUNTER"] = {
					0.73828126, -- [1]
					1, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["Horde"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["PALADIN"] = {
					0, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["ROGUE"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["MONSTER"] = {
					0, -- [1]
					0.25, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
			},
			["windows_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["disable_alldisplays_window"] = false,
			["standard_skin"] = false,
			["total_abbreviation"] = 2,
			["class_colors"] = {
				["HUNTER"] = {
					0.67, -- [1]
					0.83, -- [2]
					0.45, -- [3]
				},
				["WARRIOR"] = {
					0.78, -- [1]
					0.61, -- [2]
					0.43, -- [3]
				},
				["ROGUE"] = {
					1, -- [1]
					0.96, -- [2]
					0.41, -- [3]
				},
				["MAGE"] = {
					0.41, -- [1]
					0.8, -- [2]
					0.94, -- [3]
				},
				["ARENA_YELLOW"] = {
					1, -- [1]
					1, -- [2]
					0.25, -- [3]
				},
				["UNGROUPPLAYER"] = {
					0.4, -- [1]
					0.4, -- [2]
					0.4, -- [3]
				},
				["DRUID"] = {
					1, -- [1]
					0.49, -- [2]
					0.04, -- [3]
				},
				["MONK"] = {
					0, -- [1]
					1, -- [2]
					0.59, -- [3]
				},
				["DEATHKNIGHT"] = {
					0.77, -- [1]
					0.12, -- [2]
					0.23, -- [3]
				},
				["PALADIN"] = {
					0.96, -- [1]
					0.55, -- [2]
					0.73, -- [3]
				},
				["UNKNOW"] = {
					0.2, -- [1]
					0.2, -- [2]
					0.2, -- [3]
				},
				["PRIEST"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
				},
				["SHAMAN"] = {
					0, -- [1]
					0.44, -- [2]
					0.87, -- [3]
				},
				["ENEMY"] = {
					0.94117, -- [1]
					0, -- [2]
					0.0196, -- [3]
					1, -- [4]
				},
				["WARLOCK"] = {
					0.58, -- [1]
					0.51, -- [2]
					0.79, -- [3]
				},
				["DEMONHUNTER"] = {
					0.64, -- [1]
					0.19, -- [2]
					0.79, -- [3]
				},
				["version"] = 1,
				["NEUTRAL"] = {
					1, -- [1]
					1, -- [2]
					0, -- [3]
				},
				["ARENA_GREEN"] = {
					0.4, -- [1]
					1, -- [2]
					0.4, -- [3]
				},
				["PET"] = {
					0.3, -- [1]
					0.4, -- [2]
					0.5, -- [3]
				},
			},
			["segments_auto_erase"] = 1,
			["clear_graphic"] = true,
			["trash_auto_remove"] = true,
			["animation_speed_triggertravel"] = 5,
			["options_group_edit"] = true,
			["segments_amount_to_save"] = 18,
			["minimap"] = {
				["onclick_what_todo"] = 1,
				["radius"] = 160,
				["hide"] = false,
				["minimapPos"] = 220,
				["text_format"] = 3,
				["text_type"] = 1,
			},
			["instances_amount"] = 5,
			["max_window_size"] = {
				["height"] = 450,
				["width"] = 480,
			},
			["deny_score_messages"] = false,
			["only_pvp_frags"] = false,
			["disable_stretch_button"] = false,
			["default_bg_color"] = 0.0941,
			["broadcaster_enabled"] = false,
			["hotcorner_topleft"] = {
				["hide"] = false,
			},
			["segments_panic_mode"] = false,
			["numerical_system_symbols"] = "auto",
			["overall_flag"] = 16,
			["row_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["chat_tab_embed"] = {
				["enabled"] = false,
				["y_offset"] = 0,
				["x_offset"] = 0,
				["tab_name"] = "",
				["single_window"] = false,
			},
			["player_details_window"] = {
				["scale"] = 1,
				["skin"] = "ElvUI",
				["bar_texture"] = "Skyline",
			},
			["numerical_system"] = 1,
			["force_activity_time_pvp"] = true,
			["pvp_as_group"] = true,
			["class_icons_small"] = "Interface\\AddOns\\Details\\images\\classes_small",
			["disable_reset_button"] = false,
			["animate_scroll"] = false,
			["death_tooltip_width"] = 350,
			["time_type"] = 2,
			["default_bg_alpha"] = 0.5,
			["time_type_original"] = 2,
		},
		["苍炎月影-黑曜石之锋"] = {
			["show_arena_role_icon"] = false,
			["capture_real"] = {
				["heal"] = true,
				["spellcast"] = true,
				["miscdata"] = true,
				["aura"] = true,
				["energy"] = true,
				["damage"] = true,
			},
			["row_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["streamer_config"] = {
				["faster_updates"] = false,
				["quick_detection"] = false,
				["reset_spec_cache"] = false,
				["no_alerts"] = false,
				["disable_mythic_dungeon"] = false,
				["use_animation_accel"] = true,
			},
			["all_players_are_group"] = false,
			["use_row_animations"] = true,
			["report_heal_links"] = false,
			["remove_realm_from_name"] = true,
			["minimum_overall_combat_time"] = 10,
			["event_tracker"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["line_height"] = 16,
				["line_color"] = {
					0.1, -- [1]
					0.1, -- [2]
					0.1, -- [3]
					0.3, -- [4]
				},
				["font_shadow"] = "NONE",
				["font_size"] = 10,
				["font_face"] = "Friz Quadrata TT",
				["frame"] = {
					["show_title"] = true,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0.16, -- [1]
						0.16, -- [2]
						0.16, -- [3]
						0.47, -- [4]
					},
					["locked"] = false,
					["height"] = 300,
					["width"] = 250,
				},
				["line_texture"] = "Details Serenity",
				["options_frame"] = {
				},
			},
			["report_to_who"] = "",
			["class_specs_coords"] = {
				[62] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[63] = {
					0.375, -- [1]
					0.5, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[250] = {
					0, -- [1]
					0.125, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[251] = {
					0.125, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[252] = {
					0.25, -- [1]
					0.375, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[253] = {
					0.875, -- [1]
					1, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[254] = {
					0, -- [1]
					0.125, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[255] = {
					0.125, -- [1]
					0.25, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[66] = {
					0.125, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[257] = {
					0.5, -- [1]
					0.625, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[258] = {
					0.6328125, -- [1]
					0.75, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[259] = {
					0.75, -- [1]
					0.875, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[260] = {
					0.875, -- [1]
					1, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[577] = {
					0.25, -- [1]
					0.375, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[262] = {
					0.125, -- [1]
					0.25, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[581] = {
					0.375, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[264] = {
					0.375, -- [1]
					0.5, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[265] = {
					0.5, -- [1]
					0.625, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[266] = {
					0.625, -- [1]
					0.75, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[267] = {
					0.75, -- [1]
					0.875, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[268] = {
					0.625, -- [1]
					0.75, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[269] = {
					0.875, -- [1]
					1, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[270] = {
					0.75, -- [1]
					0.875, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[70] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[102] = {
					0.375, -- [1]
					0.5, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[71] = {
					0.875, -- [1]
					1, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[103] = {
					0.5, -- [1]
					0.625, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[72] = {
					0, -- [1]
					0.125, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[104] = {
					0.625, -- [1]
					0.75, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[73] = {
					0.125, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[263] = {
					0.25, -- [1]
					0.375, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[105] = {
					0.75, -- [1]
					0.875, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[261] = {
					0, -- [1]
					0.125, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[256] = {
					0.375, -- [1]
					0.5, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[65] = {
					0, -- [1]
					0.125, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[64] = {
					0.5, -- [1]
					0.625, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
			},
			["profile_save_pos"] = true,
			["tooltip"] = {
				["header_statusbar"] = {
					0.3, -- [1]
					0.3, -- [2]
					0.3, -- [3]
					0.8, -- [4]
					false, -- [5]
					false, -- [6]
					"WorldState Score", -- [7]
				},
				["fontcolor_right"] = {
					1, -- [1]
					0.7, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["line_height"] = 17,
				["tooltip_max_targets"] = 2,
				["icon_size"] = {
					["W"] = 17,
					["H"] = 17,
				},
				["tooltip_max_pets"] = 2,
				["anchor_relative"] = "top",
				["abbreviation"] = 2,
				["anchored_to"] = 1,
				["show_amount"] = false,
				["header_text_color"] = {
					1, -- [1]
					0.9176, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["fontsize"] = 15,
				["background"] = {
					0.196, -- [1]
					0.196, -- [2]
					0.196, -- [3]
					0.8, -- [4]
				},
				["submenu_wallpaper"] = true,
				["fontsize_title"] = 10,
				["fontcolor"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["commands"] = {
				},
				["tooltip_max_abilities"] = 6,
				["fontface"] = "Friz Quadrata TT",
				["border_color"] = {
					0, -- [1]
					0, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["border_texture"] = "Details BarBorder 3",
				["anchor_offset"] = {
					0, -- [1]
					0, -- [2]
				},
				["menus_bg_texture"] = "Interface\\SPELLBOOK\\Spellbook-Page-1",
				["maximize_method"] = 1,
				["border_size"] = 14,
				["fontshadow"] = false,
				["anchor_screen_pos"] = {
					507.7, -- [1]
					-350.5, -- [2]
				},
				["anchor_point"] = "bottom",
				["menus_bg_coords"] = {
					0.309777336120606, -- [1]
					0.924000015258789, -- [2]
					0.213000011444092, -- [3]
					0.279000015258789, -- [4]
				},
				["icon_border_texcoord"] = {
					["R"] = 0.921875,
					["L"] = 0.078125,
					["T"] = 0.078125,
					["B"] = 0.921875,
				},
				["menus_bg_color"] = {
					0.8, -- [1]
					0.8, -- [2]
					0.8, -- [3]
					0.2, -- [4]
				},
			},
			["ps_abbreviation"] = 3,
			["world_combat_is_trash"] = false,
			["update_speed"] = 0.2,
			["bookmark_text_size"] = 11,
			["animation_speed_mintravel"] = 0.45,
			["track_item_level"] = true,
			["windows_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["instances_menu_click_to_open"] = false,
			["overall_clear_newchallenge"] = true,
			["current_dps_meter"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["arena_enabled"] = true,
				["font_shadow"] = "NONE",
				["font_size"] = 18,
				["mythic_dungeon_enabled"] = true,
				["sample_size"] = 5,
				["font_face"] = "Friz Quadrata TT",
				["frame"] = {
					["show_title"] = false,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0.2, -- [4]
					},
					["locked"] = false,
					["height"] = 65,
					["width"] = 220,
				},
				["update_interval"] = 0.3,
				["options_frame"] = {
				},
			},
			["data_cleanup_logout"] = false,
			["instances_disable_bar_highlight"] = false,
			["trash_concatenate"] = false,
			["color_by_arena_team"] = true,
			["animation_speed"] = 33,
			["disable_stretch_from_toolbar"] = false,
			["disable_lock_ungroup_buttons"] = false,
			["memory_ram"] = 64,
			["disable_window_groups"] = false,
			["instances_suppress_trash"] = 0,
			["options_window"] = {
				["scale"] = 1,
			},
			["animation_speed_maxtravel"] = 3,
			["instances_segments_locked"] = false,
			["deadlog_limit"] = 16,
			["font_faces"] = {
				["menus"] = "Friz Quadrata TT",
			},
			["instances_no_libwindow"] = false,
			["instances"] = {
				{
					["__pos"] = {
						["normal"] = {
							["y"] = -420.000770568848,
							["x"] = 797.001831054688,
							["w"] = 320,
							["h"] = 190.000045776367,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["show_statusbar"] = false,
					["clickthrough_window"] = false,
					["menu_anchor"] = {
						16, -- [1]
						3, -- [2]
						["side"] = 2,
					},
					["bg_r"] = 0.0941176470588235,
					["hide_out_of_combat"] = false,
					["color_buttons"] = {
						1, -- [1]
						1, -- [2]
						1, -- [3]
						1, -- [4]
					},
					["toolbar_icon_file"] = "Interface\\AddOns\\Details\\images\\toolbar_icons",
					["bars_sort_direction"] = 1,
					["tooltip"] = {
						["n_abilities"] = 3,
						["n_enemies"] = 3,
					},
					["switch_all_roles_in_combat"] = false,
					["clickthrough_toolbaricons"] = false,
					["clickthrough_rows"] = false,
					["ignore_mass_showhide"] = false,
					["plugins_grow_direction"] = 1,
					["menu_icons"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						false, -- [6]
						["space"] = -2,
						["shadow"] = false,
					},
					["desaturated_menu"] = true,
					["show_sidebars"] = false,
					["window_scale"] = 1,
					["hide_icon"] = false,
					["toolbar_side"] = 1,
					["bg_g"] = 0.0941176470588235,
					["bg_b"] = 0.0941176470588235,
					["switch_healer_in_combat"] = false,
					["color"] = {
						0.0705882352941177, -- [1]
						0.0705882352941177, -- [2]
						0.0705882352941177, -- [3]
						0.639196664094925, -- [4]
					},
					["skin"] = "Minimalistic",
					["following"] = {
						["enabled"] = false,
						["bar_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["switch_healer"] = false,
					["StatusBarSaved"] = {
						["center"] = "DETAILS_STATUSBAR_PLUGIN_CLOCK",
						["right"] = "DETAILS_STATUSBAR_PLUGIN_PDPS",
						["options"] = {
							["DETAILS_STATUSBAR_PLUGIN_PDPS"] = {
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["textXMod"] = 0,
								["textFace"] = "Accidental Presidency",
								["textStyle"] = 2,
								["textAlign"] = 0,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
							["DETAILS_STATUSBAR_PLUGIN_PSEGMENT"] = {
								["textYMod"] = 1,
								["segmentType"] = 2,
								["textXMod"] = 0,
								["textFace"] = "Accidental Presidency",
								["textStyle"] = 2,
								["textAlign"] = 0,
								["textSize"] = 10,
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
							},
							["DETAILS_STATUSBAR_PLUGIN_CLOCK"] = {
								["textYMod"] = 1,
								["textFace"] = "Accidental Presidency",
								["textXMod"] = 6,
								["timeType"] = 1,
								["textStyle"] = 2,
								["textAlign"] = 0,
								["textSize"] = 10,
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
							},
						},
						["left"] = "DETAILS_STATUSBAR_PLUGIN_PSEGMENT",
					},
					["instance_button_anchor"] = {
						-27, -- [1]
						1, -- [2]
					},
					["version"] = 3,
					["__locked"] = true,
					["menu_alpha"] = {
						["enabled"] = false,
						["onleave"] = 1,
						["ignorebars"] = false,
						["iconstoo"] = true,
						["onenter"] = 1,
					},
					["menu_icons_size"] = 1,
					["micro_displays_locked"] = true,
					["strata"] = "LOW",
					["clickthrough_incombatonly"] = true,
					["__snap"] = {
					},
					["auto_hide_menu"] = {
						["left"] = false,
						["right"] = false,
					},
					["hide_in_combat_alpha"] = 0,
					["switch_damager"] = false,
					["stretch_button_side"] = 1,
					["libwindow"] = {
						["y"] = 25.0000629425049,
						["x"] = -2.9998779296875,
						["point"] = "BOTTOMRIGHT",
						["scale"] = 1,
					},
					["statusbar_info"] = {
						["alpha"] = 0.3777777777777,
						["overlay"] = {
							0.333333333333333, -- [1]
							0.333333333333333, -- [2]
							0.333333333333333, -- [3]
						},
					},
					["row_show_animation"] = {
						["anim"] = "Fade",
						["options"] = {
						},
					},
					["menu_anchor_down"] = {
						16, -- [1]
						-3, -- [2]
					},
					["switch_tank"] = false,
					["switch_all_roles_after_wipe"] = false,
					["switch_damager_in_combat"] = false,
					["grab_on_top"] = false,
					["bars_grow_direction"] = 1,
					["row_info"] = {
						["textR_outline"] = true,
						["spec_file"] = "Interface\\AddOns\\Details\\images\\spec_icons_normal",
						["textL_outline"] = true,
						["textR_outline_small"] = false,
						["textR_show_data"] = {
							true, -- [1]
							true, -- [2]
							false, -- [3]
						},
						["textL_enable_custom_text"] = false,
						["fixed_text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["space"] = {
							["right"] = 0,
							["left"] = 0,
							["between"] = 1,
						},
						["texture_background_class_color"] = false,
						["textL_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["font_face_file"] = "Fonts\\ARKai_T.ttf",
						["backdrop"] = {
							["enabled"] = false,
							["texture"] = "Details BarBorder 2",
							["color"] = {
								1, -- [1]
								1, -- [2]
								1, -- [3]
								1, -- [4]
							},
							["size"] = 12,
						},
						["models"] = {
							["upper_model"] = "Spells\\AcidBreath_SuperGreen.M2",
							["lower_model"] = "World\\EXPANSION02\\DOODADS\\Coldarra\\COLDARRALOCUS.m2",
							["upper_alpha"] = 0.5,
							["lower_enabled"] = false,
							["lower_alpha"] = 0.1,
							["upper_enabled"] = false,
						},
						["texture_custom_file"] = "Interface\\",
						["texture_file"] = "Interface\\Addons\\NDui\\Media\\Armory",
						["height"] = 18,
						["textL_custom_text"] = "{data1}. {data3}{data2}",
						["icon_file"] = "Interface\\AddOns\\Details\\images\\classes_small",
						["icon_grayscale"] = false,
						["textR_bracket"] = "(",
						["use_spec_icons"] = true,
						["textR_enable_custom_text"] = false,
						["start_after_icon"] = true,
						["fixed_texture_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
						},
						["textL_show_number"] = true,
						["textL_outline_small"] = false,
						["fixed_texture_background_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							0.150228589773178, -- [4]
						},
						["textR_custom_text"] = "{data1} ({data2}, {data3}%)",
						["texture"] = "normTex",
						["texture_custom"] = "",
						["texture_background_file"] = "Interface\\AddOns\\Details\\images\\bar4_reverse",
						["textL_class_colors"] = false,
						["alpha"] = 1,
						["texture_background"] = "Details D'ictum (reverse)",
						["textR_class_colors"] = false,
						["textR_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["no_icon"] = false,
						["icon_offset"] = {
							0, -- [1]
							0, -- [2]
						},
						["texture_highlight"] = "Interface\\FriendsFrame\\UI-FriendsList-Highlight",
						["font_face"] = "Fonts\\ARKai_T.ttf",
						["texture_class_colors"] = true,
						["percent_type"] = 1,
						["fast_ps_update"] = false,
						["textR_separator"] = "NONE",
						["font_size"] = 13,
					},
					["auto_current"] = true,
					["micro_displays_side"] = 2,
					["attribute_text"] = {
						["show_timer"] = {
							true, -- [1]
							true, -- [2]
							true, -- [3]
						},
						["shadow"] = true,
						["side"] = 1,
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["custom_text"] = "{name}",
						["text_face"] = "Fonts\\ARKai_T.ttf",
						["anchor"] = {
							0, -- [1]
							3, -- [2]
						},
						["enabled"] = true,
						["enable_custom_text"] = false,
						["text_size"] = 13,
					},
					["bg_alpha"] = 0.183960914611816,
					["hide_in_combat"] = false,
					["posicao"] = {
						["normal"] = {
							["y"] = -420.000770568848,
							["x"] = 797.001831054688,
							["w"] = 320,
							["h"] = 190.000045776367,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["bars_inverted"] = false,
					["skin_custom"] = "",
					["wallpaper"] = {
						["enabled"] = false,
						["texcoord"] = {
							0, -- [1]
							1, -- [2]
							0, -- [3]
							0.7, -- [4]
						},
						["overlay"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["anchor"] = "all",
						["height"] = 114.042518615723,
						["alpha"] = 0.5,
						["width"] = 283.000183105469,
					},
					["total_bar"] = {
						["enabled"] = false,
						["only_in_group"] = true,
						["icon"] = "Interface\\ICONS\\INV_Sigil_Thorim",
						["color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["switch_tank_in_combat"] = false,
					["backdrop_texture"] = "None",
					["__was_opened"] = true,
					["hide_in_combat_type"] = 1,
				}, -- [1]
			},
			["data_broker_text"] = "",
			["segments_amount"] = 18,
			["report_lines"] = 5,
			["clear_ungrouped"] = true,
			["use_battleground_server_parser"] = false,
			["skin"] = "WoW Interface",
			["override_spellids"] = true,
			["use_scroll"] = false,
			["report_schema"] = 1,
			["overall_clear_newboss"] = true,
			["overall_clear_logout"] = false,
			["minimum_combat_time"] = 5,
			["font_sizes"] = {
				["menus"] = 10,
			},
			["cloud_capture"] = true,
			["damage_taken_everything"] = false,
			["scroll_speed"] = 2,
			["new_window_size"] = {
				["height"] = 158,
				["width"] = 310,
			},
			["chat_tab_embed"] = {
				["enabled"] = false,
				["y_offset"] = 0,
				["x_offset"] = 0,
				["tab_name"] = "",
				["single_window"] = false,
			},
			["deadlog_events"] = 32,
			["window_clamp"] = {
				-8, -- [1]
				0, -- [2]
				21, -- [3]
				-14, -- [4]
			},
			["close_shields"] = false,
			["class_coords"] = {
				["HUNTER"] = {
					0, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["WARRIOR"] = {
					0, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["ROGUE"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["MAGE"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["PET"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["DRUID"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["MONK"] = {
					0.5, -- [1]
					0.73828125, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["DEATHKNIGHT"] = {
					0.25, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["UNGROUPPLAYER"] = {
					0.5, -- [1]
					0.75, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["UNKNOW"] = {
					0.5, -- [1]
					0.75, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["PRIEST"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["WARLOCK"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["Alliance"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["ENEMY"] = {
					0, -- [1]
					0.25, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["DEMONHUNTER"] = {
					0.73828126, -- [1]
					1, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["Horde"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["PALADIN"] = {
					0, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["SHAMAN"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["MONSTER"] = {
					0, -- [1]
					0.25, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
			},
			["windows_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["disable_alldisplays_window"] = false,
			["standard_skin"] = false,
			["hotcorner_topleft"] = {
				["hide"] = false,
			},
			["trash_auto_remove"] = true,
			["animation_speed_triggertravel"] = 5,
			["clear_graphic"] = true,
			["class_colors"] = {
				["HUNTER"] = {
					0.67, -- [1]
					0.83, -- [2]
					0.45, -- [3]
				},
				["WARRIOR"] = {
					0.78, -- [1]
					0.61, -- [2]
					0.43, -- [3]
				},
				["ROGUE"] = {
					1, -- [1]
					0.96, -- [2]
					0.41, -- [3]
				},
				["MAGE"] = {
					0.41, -- [1]
					0.8, -- [2]
					0.94, -- [3]
				},
				["ARENA_YELLOW"] = {
					1, -- [1]
					1, -- [2]
					0.25, -- [3]
				},
				["UNGROUPPLAYER"] = {
					0.4, -- [1]
					0.4, -- [2]
					0.4, -- [3]
				},
				["DRUID"] = {
					1, -- [1]
					0.49, -- [2]
					0.04, -- [3]
				},
				["MONK"] = {
					0, -- [1]
					1, -- [2]
					0.59, -- [3]
				},
				["DEATHKNIGHT"] = {
					0.77, -- [1]
					0.12, -- [2]
					0.23, -- [3]
				},
				["SHAMAN"] = {
					0, -- [1]
					0.44, -- [2]
					0.87, -- [3]
				},
				["UNKNOW"] = {
					0.2, -- [1]
					0.2, -- [2]
					0.2, -- [3]
				},
				["PRIEST"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
				},
				["PALADIN"] = {
					0.96, -- [1]
					0.55, -- [2]
					0.73, -- [3]
				},
				["WARLOCK"] = {
					0.58, -- [1]
					0.51, -- [2]
					0.79, -- [3]
				},
				["ENEMY"] = {
					0.94117, -- [1]
					0, -- [2]
					0.0196, -- [3]
					1, -- [4]
				},
				["DEMONHUNTER"] = {
					0.64, -- [1]
					0.19, -- [2]
					0.79, -- [3]
				},
				["version"] = 1,
				["NEUTRAL"] = {
					1, -- [1]
					1, -- [2]
					0, -- [3]
				},
				["ARENA_GREEN"] = {
					0.4, -- [1]
					1, -- [2]
					0.4, -- [3]
				},
				["PET"] = {
					0.3, -- [1]
					0.4, -- [2]
					0.5, -- [3]
				},
			},
			["segments_auto_erase"] = 1,
			["options_group_edit"] = true,
			["broadcaster_enabled"] = false,
			["minimap"] = {
				["onclick_what_todo"] = 1,
				["radius"] = 160,
				["hide"] = false,
				["minimapPos"] = 220,
				["text_format"] = 3,
				["text_type"] = 1,
			},
			["instances_amount"] = 5,
			["max_window_size"] = {
				["height"] = 450,
				["width"] = 480,
			},
			["deny_score_messages"] = false,
			["only_pvp_frags"] = false,
			["disable_stretch_button"] = false,
			["default_bg_color"] = 0.0941,
			["segments_amount_to_save"] = 18,
			["total_abbreviation"] = 2,
			["segments_panic_mode"] = false,
			["numerical_system_symbols"] = "auto",
			["overall_flag"] = 16,
			["row_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["memory_threshold"] = 3,
			["player_details_window"] = {
				["scale"] = 1,
				["skin"] = "ElvUI",
				["bar_texture"] = "Skyline",
			},
			["numerical_system"] = 1,
			["force_activity_time_pvp"] = true,
			["pvp_as_group"] = true,
			["class_icons_small"] = "Interface\\AddOns\\Details\\images\\classes_small",
			["disable_reset_button"] = false,
			["animate_scroll"] = false,
			["death_tooltip_width"] = 350,
			["time_type"] = 2,
			["default_bg_alpha"] = 0.5,
			["time_type_original"] = 2,
		},
	},
	["boss_mods_timers"] = {
		["encounter_timers_bw"] = {
		},
		["encounter_timers_dbm"] = {
		},
	},
	["spell_school_cache"] = {
	},
	["deathlog_healingdone_min"] = 1,
	["plater"] = {
		["realtime_dps_enabled"] = false,
		["realtime_dps_size"] = 12,
		["realtime_dps_player_shadow"] = true,
		["damage_taken_enabled"] = false,
		["realtime_dps_player_size"] = 12,
		["damage_taken_size"] = 12,
		["realtime_dps_color"] = {
			1, -- [1]
			1, -- [2]
			0, -- [3]
			1, -- [4]
		},
		["realtime_dps_anchor"] = {
			["y"] = 0,
			["x"] = 0,
			["side"] = 7,
		},
		["damage_taken_shadow"] = true,
		["damage_taken_anchor"] = {
			["y"] = 0,
			["x"] = 0,
			["side"] = 7,
		},
		["damage_taken_color"] = {
			1, -- [1]
			1, -- [2]
			0, -- [3]
			1, -- [4]
		},
		["realtime_dps_player_color"] = {
			1, -- [1]
			1, -- [2]
			0, -- [3]
			1, -- [4]
		},
		["realtime_dps_player_anchor"] = {
			["y"] = 0,
			["x"] = 0,
			["side"] = 7,
		},
		["realtime_dps_player_enabled"] = false,
		["realtime_dps_shadow"] = true,
	},
	["run_code"] = {
		["on_specchanged"] = "\n-- run when the player changes its spec",
		["on_zonechanged"] = "\n-- when the player changes zone, this code will run",
		["on_init"] = "\n-- code to run when Details! initializes, put here code which only will run once\n-- this also will run then the profile is changed\n\n--size of the death log tooltip in the Deaths display (default 350)\nDetails.death_tooltip_width = 350;\n\n--when in arena or battleground, details! silently switch to activity time (goes back to the old setting on leaving, default true)\nDetails.force_activity_time_pvp = true;\n\n--speed of the bar animations (default 33)\nDetails.animation_speed = 33;\n\n--threshold to trigger slow or fast speed (default 0.45)\nDetails.animation_speed_mintravel = 0.45;\n\n--call to update animations\nDetails:RefreshAnimationFunctions();\n\n--max window size, does require a /reload to work (default 480 x 450)\nDetails.max_window_size.width = 480;\nDetails.max_window_size.height = 450;\n\n--use the arena team color as the class color (default true)\nDetails.color_by_arena_team = true;\n\n--use the role icon in the player bar when inside an arena (default false)\nDetails.show_arena_role_icon = false;\n\n--how much time the update warning is shown (default 10)\nDetails.update_warning_timeout = 10;",
		["on_groupchange"] = "\n-- this code runs when the player enter or leave a group",
		["on_leavecombat"] = "\n-- this code runs when the player leave combat",
		["on_entercombat"] = "\n-- this code runs when the player enters in combat",
	},
	["mythic_plus"] = {
		["make_overall_boss_only"] = false,
		["mythicrun_chart_frame"] = {
		},
		["merge_boss_trash"] = true,
		["delay_to_show_graphic"] = 5,
		["always_in_combat"] = false,
		["make_overall_when_done"] = true,
		["delete_trash_after_merge"] = true,
		["show_damage_graphic"] = true,
		["mythicrun_chart_frame_ready"] = {
		},
		["boss_dedicated_segment"] = true,
		["mythicrun_chart_frame_minimized"] = {
		},
		["last_mythicrun_chart"] = {
		},
	},
	["global_plugin_database"] = {
	},
	["realm_sync"] = true,
	["createauraframe"] = {
	},
	["item_level_pool"] = {
		["Player-4822-00B0C4C2"] = {
			["time"] = 1569941674,
			["name"] = "理之超越",
			["ilvl"] = 0,
		},
		["Player-4822-00B5A5BA"] = {
			["time"] = 1569951514,
			["name"] = "苍炎胧影",
			["ilvl"] = 0,
		},
	},
	["switchSaved"] = {
		["slots"] = 21,
		["table"] = {
			{
				["atributo"] = 1,
				["sub_atributo"] = 1,
			}, -- [1]
			{
				["atributo"] = 2,
				["sub_atributo"] = 1,
			}, -- [2]
			{
				["atributo"] = 1,
				["sub_atributo"] = 6,
			}, -- [3]
			{
				["atributo"] = 4,
				["sub_atributo"] = 5,
			}, -- [4]
			{
				["atributo"] = "plugin",
				["sub_atributo"] = "DETAILS_PLUGIN_TINY_THREAT",
			}, -- [5]
			{
				["atributo"] = 4,
				["sub_atributo"] = 7,
			}, -- [6]
			{
				["atributo"] = 4,
				["sub_atributo"] = 8,
			}, -- [7]
			{
				["atributo"] = 3,
				["sub_atributo"] = 2,
			}, -- [8]
			{
			}, -- [9]
			{
			}, -- [10]
			{
			}, -- [11]
			{
			}, -- [12]
			{
			}, -- [13]
			{
			}, -- [14]
			{
			}, -- [15]
			{
			}, -- [16]
			{
			}, -- [17]
			{
			}, -- [18]
			{
			}, -- [19]
			{
			}, -- [20]
			{
			}, -- [21]
			{
			}, -- [22]
			{
			}, -- [23]
			{
			}, -- [24]
			{
			}, -- [25]
			{
			}, -- [26]
			{
			}, -- [27]
			{
			}, -- [28]
			{
			}, -- [29]
			{
			}, -- [30]
		},
	},
	["savedCustomSpells"] = {
		{
			3, -- [1]
			"环境伤害 (高处坠落)", -- [2]
			"Interface\\ICONS\\Spell_Magic_FeatherFall", -- [3]
		}, -- [1]
		{
			1, -- [1]
			"近战", -- [2]
			"Interface\\ICONS\\INV_Sword_04", -- [3]
		}, -- [2]
		{
			4, -- [1]
			"环境伤害 (溺水)", -- [2]
			"Interface\\ICONS\\Ability_Suffocate", -- [3]
		}, -- [3]
		{
			5, -- [1]
			"环境伤害 (疲劳)", -- [2]
			"Interface\\ICONS\\Spell_Arcane_MindMastery", -- [3]
		}, -- [4]
		{
			7, -- [1]
			"环境伤害 (岩浆)", -- [2]
			"Interface\\ICONS\\Ability_Rhyolith_Volcano", -- [3]
		}, -- [5]
	},
	["update_warning_timeout"] = 10,
	["show_totalhitdamage_on_overkill"] = false,
	["raid_data"] = {
	},
	["tutorial"] = {
		["unlock_button"] = 2,
		["main_help_button"] = 157,
		["WINDOW_GROUP_MAKING1"] = true,
		["DETAILS_INFO_TUTORIAL1"] = true,
		["ATTRIBUTE_SELECT_TUTORIAL1"] = true,
		["MIN_COMBAT_TIME"] = true,
		["OPTIONS_PANEL_OPENED"] = true,
		["WINDOW_LOCK_UNLOCK1"] = true,
		["logons"] = 157,
		["version_announce"] = 0,
		["DETAILS_INFO_TUTORIAL2"] = 6,
		["ctrl_click_close_tutorial"] = false,
		["bookmark_tutorial"] = false,
		["alert_frames"] = {
			false, -- [1]
			false, -- [2]
			false, -- [3]
			false, -- [4]
			false, -- [5]
			false, -- [6]
		},
	},
	["always_use_profile_name"] = "",
	["savedStyles"] = {
	},
	["always_use_profile_exception"] = {
	},
	["details_auras"] = {
	},
	["latest_news_saw"] = "",
	["savedTimeCaptures"] = {
	},
	["plugin_window_pos"] = {
		["y"] = -3.8146972656250e-06,
		["x"] = 9.15527343750e-05,
		["point"] = "CENTER",
		["scale"] = 1,
	},
	["custom"] = {
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "显示你的团队中谁在战斗时使用了药水.",
			["tooltip"] = "			--init:\n			local player, combat, instance = ...\n\n			--get the debuff container for potion of focus\n			local debuff_uptime_container = player.debuff_uptime and player.debuff_uptime_spells and player.debuff_uptime_spells._ActorTable\n			if (debuff_uptime_container) then\n			    local focus_potion = debuff_uptime_container [DETAILS_FOCUS_POTION_ID]\n			    if (focus_potion) then\n				local name, _, icon = GetSpellInfo (DETAILS_FOCUS_POTION_ID)\n				GameCooltip:AddLine (name, 1) --> can use only 1 focus potion (can't be pre-potion)\n				_detalhes:AddTooltipBackgroundStatusbar()\n				GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n			    end\n			end\n\n			--get the buff container for all the others potions\n			local buff_uptime_container = player.buff_uptime and player.buff_uptime_spells and player.buff_uptime_spells._ActorTable\n			if (buff_uptime_container) then\n			    --potion of the jade serpent\n			    local jade_serpent_potion = buff_uptime_container [DETAILS_INT_POTION_ID]\n			    if (jade_serpent_potion) then\n				local name, _, icon = GetSpellInfo (DETAILS_INT_POTION_ID)\n				GameCooltip:AddLine (name, jade_serpent_potion.activedamt)\n				_detalhes:AddTooltipBackgroundStatusbar()\n				GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n			    end\n			    \n			    --potion of mogu power\n			    local mogu_power_potion = buff_uptime_container [DETAILS_STR_POTION_ID]\n			    if (mogu_power_potion) then\n				local name, _, icon = GetSpellInfo (DETAILS_STR_POTION_ID)\n				GameCooltip:AddLine (name, mogu_power_potion.activedamt)\n				_detalhes:AddTooltipBackgroundStatusbar()\n				GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n			    end\n			    \n			    --mana potion\n			    local mana_potion = buff_uptime_container [DETAILS_MANA_POTION_ID]\n			    if (mana_potion) then\n				local name, _, icon = GetSpellInfo (DETAILS_MANA_POTION_ID)\n				GameCooltip:AddLine (name, mana_potion.activedamt)\n				_detalhes:AddTooltipBackgroundStatusbar()\n				GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n			    end\n			    \n			    --prolongued power\n			    local prolongued_power = buff_uptime_container [DETAILS_AGI_POTION_ID]\n			    if (prolongued_power) then\n				local name, _, icon = GetSpellInfo (DETAILS_AGI_POTION_ID)\n				GameCooltip:AddLine (name, prolongued_power.activedamt)\n				_detalhes:AddTooltipBackgroundStatusbar()\n				GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n			    end\n			    \n			    --potion of the mountains\n			    local mountains_potion = buff_uptime_container [DETAILS_STAMINA_POTION_ID]\n			    if (mountains_potion) then\n				local name, _, icon = GetSpellInfo (DETAILS_STAMINA_POTION_ID)\n				GameCooltip:AddLine (name, mountains_potion.activedamt)\n				_detalhes:AddTooltipBackgroundStatusbar()\n				GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n			    end\n			end\n		",
			["attribute"] = false,
			["name"] = "有使用药水",
			["script"] = "				--init:\n				local combat, instance_container, instance = ...\n				local total, top, amount = 0, 0, 0\n\n				--get the misc actor container\n				local misc_container = combat:GetActorList ( DETAILS_ATTRIBUTE_MISC )\n\n				--do the loop:\n				for _, player in ipairs ( misc_container ) do \n				    \n				    --only player in group\n				    if (player:IsGroupPlayer()) then\n					\n					local found_potion = false\n					\n					--get the spell debuff uptime container\n					local debuff_uptime_container = player.debuff_uptime and player.debuff_uptime_spells and player.debuff_uptime_spells._ActorTable\n					if (debuff_uptime_container) then\n					    --potion of focus (can't use as pre-potion, so, its amount is always 1\n					    local focus_potion = debuff_uptime_container [DETAILS_FOCUS_POTION_ID]\n\n					    if (focus_potion) then\n						total = total + 1\n						found_potion = true\n						if (top < 1) then\n						    top = 1\n						end\n						--add amount to the player \n						instance_container:AddValue (player, 1)\n					    end\n					end\n					\n					--get the spell buff uptime container\n					local buff_uptime_container = player.buff_uptime and player.buff_uptime_spells and player.buff_uptime_spells._ActorTable\n					if (buff_uptime_container) then\n					    \n					    --potion of the jade serpent\n					    local jade_serpent_potion = buff_uptime_container [DETAILS_INT_POTION_ID]\n					    if (jade_serpent_potion) then\n						local used = jade_serpent_potion.activedamt\n						if (used > 0) then\n						    total = total + used\n						    found_potion = true\n						    if (used > top) then\n							top = used\n						    end\n						    --add amount to the player \n						    instance_container:AddValue (player, used)\n						end\n					    end\n					    \n					    --potion of mogu power\n					    local mogu_power_potion = buff_uptime_container [DETAILS_STR_POTION_ID]\n					    if (mogu_power_potion) then\n						local used = mogu_power_potion.activedamt\n						if (used > 0) then\n						    total = total + used\n						    found_potion = true\n						    if (used > top) then\n							top = used\n						    end\n						    --add amount to the player \n						    instance_container:AddValue (player, used)\n						end\n					    end\n					    \n					    --mana potion\n					    local mana_potion = buff_uptime_container [DETAILS_MANA_POTION_ID]\n					    if (mana_potion) then\n						local used = mana_potion.activedamt\n						if (used > 0) then\n						    total = total + used\n						    found_potion = true\n						    if (used > top) then\n							top = used\n						    end\n						    --add amount to the player \n						    instance_container:AddValue (player, used)\n						end\n					    end\n					    \n					    --potion of prolongued power\n					    local prolongued_power = buff_uptime_container [DETAILS_AGI_POTION_ID]\n					    if (prolongued_power) then\n						local used = prolongued_power.activedamt\n						if (used > 0) then\n						    total = total + used\n						    found_potion = true\n						    if (used > top) then\n							top = used\n						    end\n						    --add amount to the player \n						    instance_container:AddValue (player, used)\n						end\n					    end\n					    \n					    --potion of the mountains\n					    local mountains_potion = buff_uptime_container [DETAILS_STAMINA_POTION_ID]\n					    if (mountains_potion) then\n						local used = mountains_potion.activedamt\n						if (used > 0) then\n						    total = total + used\n						    found_potion = true\n						    if (used > top) then\n							top = used\n						    end\n						    --add amount to the player \n						    instance_container:AddValue (player, used)\n						end\n					    end\n					end\n					\n					if (found_potion) then\n					    amount = amount + 1\n					end    \n				    end\n				end\n\n				--return:\n				return total, top, amount\n				",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\ICONS\\Trade_Alchemy_PotionD4",
			["script_version"] = 4,
		}, -- [1]
		{
			["source"] = false,
			["desc"] = "显示你的队伍中谁使用过治疗药水或者治疗石",
			["author"] = "Details! Team",
			["percent_script"] = false,
			["total_script"] = false,
			["attribute"] = false,
			["tooltip"] = "			--get the parameters passed\n			local actor, combat, instance = ...\n			\n			--get the cooltip object (we dont use the convencional GameTooltip here)\n			local GameCooltip = GameCooltip\n			local R, G, B, A = 0, 0, 0, 0.75\n			\n			local hs = actor:GetSpell (6262)\n			if (hs) then\n				GameCooltip:AddLine (select (1, GetSpellInfo(6262)),  _detalhes:ToK(hs.total))\n				GameCooltip:AddIcon (select (3, GetSpellInfo (6262)), 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				GameCooltip:AddStatusBar (100, 1, R, G, B, A)\n			end\n			\n			local pot = actor:GetSpell (DETAILS_HEALTH_POTION_ID)\n			if (pot) then\n				GameCooltip:AddLine (select (1, GetSpellInfo(DETAILS_HEALTH_POTION_ID)),  _detalhes:ToK(pot.total))\n				GameCooltip:AddIcon (select (3, GetSpellInfo (DETAILS_HEALTH_POTION_ID)), 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				GameCooltip:AddStatusBar (100, 1, R, G, B, A)\n			end\n			\n			local pot = actor:GetSpell (DETAILS_REJU_POTION_ID)\n			if (pot) then\n				GameCooltip:AddLine (select (1, GetSpellInfo(DETAILS_REJU_POTION_ID)),  _detalhes:ToK(pot.total))\n				GameCooltip:AddIcon (select (3, GetSpellInfo (DETAILS_REJU_POTION_ID)), 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				GameCooltip:AddStatusBar (100, 1, R, G, B, A)\n			end\n\n			--Cooltip code\n			",
			["name"] = "治疗药水&治疗石",
			["script"] = "			--get the parameters passed\n			local combat, instance_container, instance = ...\n			--declade the values to return\n			local total, top, amount = 0, 0, 0\n			\n			--do the loop\n			local AllHealCharacters = combat:GetActorList (DETAILS_ATTRIBUTE_HEAL)\n			for index, character in ipairs (AllHealCharacters) do\n				local AllSpells = character:GetSpellList()\n				local found = false\n				for spellid, spell in pairs (AllSpells) do\n					if (DETAILS_HEALTH_POTION_LIST [spellid]) then\n						instance_container:AddValue (character, spell.total)\n						total = total + spell.total\n						if (top < spell.total) then\n							top = spell.total\n						end\n						found = true\n					end\n				end\n			\n				if (found) then\n					amount = amount + 1\n				end\n			end\n			--loop end\n			--return the values\n			return total, top, amount\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\ICONS\\warlock_ healthstone",
			["script_version"] = 14,
		}, -- [2]
		{
			["source"] = false,
			["tooltip"] = "				\n			",
			["author"] = "Details!",
			["percent_script"] = "				local value, top, total, combat, instance = ...\n				return string.format (\"%.1f\", value/top*100)\n			",
			["desc"] = "每个人造成伤害的时间",
			["attribute"] = false,
			["total_script"] = "				local value, top, total, combat, instance = ...\n				local minutos, segundos = math.floor (value/60), math.floor (value%60)\n				return minutos .. \"m \" .. segundos .. \"s\"\n			",
			["name"] = "活跃伤害时间",
			["script"] = "				--init:\n				local combat, instance_container, instance = ...\n				local total, amount = 0, 0\n\n				--get the misc actor container\n				local damage_container = combat:GetActorList ( DETAILS_ATTRIBUTE_DAMAGE )\n				\n				--do the loop:\n				for _, player in ipairs ( damage_container ) do \n					if (player.grupo) then\n						local activity = player:Tempo()\n						total = total + activity\n						amount = amount + 1\n						--add amount to the player \n						instance_container:AddValue (player, activity)\n					end\n				end\n				\n				--return:\n				return total, combat:GetCombatTime(), amount\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\ICONS\\Achievement_PVP_H_06",
			["script_version"] = 1,
		}, -- [3]
		{
			["source"] = false,
			["tooltip"] = "				\n			",
			["author"] = "Details!",
			["percent_script"] = "				local value, top, total, combat, instance = ...\n				return string.format (\"%.1f\", value/top*100)\n			",
			["desc"] = "每个人造成治疗的时间.",
			["attribute"] = false,
			["total_script"] = "				local value, top, total, combat, instance = ...\n				local minutos, segundos = math.floor (value/60), math.floor (value%60)\n				return minutos .. \"m \" .. segundos .. \"s\"\n			",
			["name"] = "活跃治疗时间",
			["script"] = "				--init:\n				local combat, instance_container, instance = ...\n				local total, top, amount = 0, 0, 0\n\n				--get the misc actor container\n				local damage_container = combat:GetActorList ( DETAILS_ATTRIBUTE_HEAL )\n				\n				--do the loop:\n				for _, player in ipairs ( damage_container ) do \n					if (player.grupo) then\n						local activity = player:Tempo()\n						total = total + activity\n						amount = amount + 1\n						--add amount to the player \n						instance_container:AddValue (player, activity)\n					end\n				end\n				\n				--return:\n				return total, combat:GetCombatTime(), amount\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\ICONS\\Achievement_PVP_G_06",
			["script_version"] = 1,
		}, -- [4]
		{
			["source"] = false,
			["author"] = "Details!",
			["total_script"] = "				local value, top, total, combat, instance = ...\n				return floor (value)\n			",
			["desc"] = "Show the crowd control amount for each player.",
			["attribute"] = false,
			["script"] = "				local combat, instance_container, instance = ...\n				local total, top, amount = 0, 0, 0\n\n				local misc_actors = combat:GetActorList (DETAILS_ATTRIBUTE_MISC)\n\n				for index, character in ipairs (misc_actors) do\n					if (character.cc_done and character:IsPlayer()) then\n						local cc_done = floor (character.cc_done)\n						instance_container:AddValue (character, cc_done)\n						total = total + cc_done\n						if (cc_done > top) then\n							top = cc_done\n						end\n						amount = amount + 1\n					end\n				end\n\n				return total, top, amount\n			",
			["name"] = "造成群体控制",
			["tooltip"] = "				local actor, combat, instance = ...\n				local spells = {}\n				for spellid, spell in pairs (actor.cc_done_spells._ActorTable) do\n				    tinsert (spells, {spellid, spell.counter})\n				end\n\n				table.sort (spells, _detalhes.Sort2)\n\n				for index, spell in ipairs (spells) do\n				    local name, _, icon = GetSpellInfo (spell [1])\n				    GameCooltip:AddLine (name, spell [2])\n				    _detalhes:AddTooltipBackgroundStatusbar()\n				    GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				end\n\n				local targets = {}\n				for playername, amount in pairs (actor.cc_done_targets) do\n				    tinsert (targets, {playername, amount})\n				end\n\n				table.sort (targets, _detalhes.Sort2)\n\n				_detalhes:AddTooltipSpellHeaderText (\"Targets\", \"yellow\", #targets)\n				local class, _, _, _, _, r, g, b = _detalhes:GetClass (actor.nome)\n				_detalhes:AddTooltipHeaderStatusbar (1, 1, 1, 0.6)\n\n				for index, target in ipairs (targets) do\n				    GameCooltip:AddLine (target[1], target [2])\n				    _detalhes:AddTooltipBackgroundStatusbar()\n				    \n				    local class, _, _, _, _, r, g, b = _detalhes:GetClass (target [1])\n				    if (class and class ~= \"UNKNOW\") then\n					local texture, l, r, t, b = _detalhes:GetClassIcon (class)\n					GameCooltip:AddIcon (\"Interface\\\\AddOns\\\\Details\\\\images\\\\classes_small_alpha\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height, l, r, t, b)\n				    else\n					GameCooltip:AddIcon (\"Interface\\\\GossipFrame\\\\IncompleteQuestIcon\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    end\n				    --\n				end\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\ICONS\\Spell_Frost_FreezingBreath",
			["script_version"] = 11,
		}, -- [5]
		{
			["source"] = false,
			["author"] = "Details!",
			["total_script"] = "				local value, top, total, combat, instance = ...\n				return floor (value)\n			",
			["desc"] = "Show the amount of crowd control received for each player.",
			["attribute"] = false,
			["script"] = "				local combat, instance_container, instance = ...\n				local total, top, amt = 0, 0, 0\n\n				local misc_actors = combat:GetActorList (DETAILS_ATTRIBUTE_MISC)\n				DETAILS_CUSTOM_CC_RECEIVED_CACHE = DETAILS_CUSTOM_CC_RECEIVED_CACHE or {}\n				wipe (DETAILS_CUSTOM_CC_RECEIVED_CACHE)\n\n				for index, character in ipairs (misc_actors) do\n				    if (character.cc_done and character:IsPlayer()) then\n					\n					for player_name, amount in pairs (character.cc_done_targets) do\n					    local target = combat (1, player_name) or combat (2, player_name)\n					    if (target and target:IsPlayer()) then\n						instance_container:AddValue (target, amount)\n						total = total + amount\n						if (amount > top) then\n						    top = amount\n						end\n						if (not DETAILS_CUSTOM_CC_RECEIVED_CACHE [player_name]) then\n						    DETAILS_CUSTOM_CC_RECEIVED_CACHE [player_name] = true\n						    amt = amt + 1\n						end\n					    end\n					end\n					\n				    end\n				end\n\n				return total, top, amt\n			",
			["name"] = "受到群体控制",
			["tooltip"] = "				local actor, combat, instance = ...\n				local name = actor:name()\n				local spells, from = {}, {}\n				local misc_actors = combat:GetActorList (DETAILS_ATTRIBUTE_MISC)\n\n				for index, character in ipairs (misc_actors) do\n				    if (character.cc_done and character:IsPlayer()) then\n					local on_actor = character.cc_done_targets [name]\n					if (on_actor) then\n					    tinsert (from, {character:name(), on_actor})\n					    \n					    for spellid, spell in pairs (character.cc_done_spells._ActorTable) do\n						\n						local spell_on_actor = spell.targets [name]\n						if (spell_on_actor) then\n						    local has_spell\n						    for index, spell_table in ipairs (spells) do\n							if (spell_table [1] == spellid) then\n							    spell_table [2] = spell_table [2] + spell_on_actor\n							    has_spell = true\n							end\n						    end\n						    if (not has_spell) then\n							tinsert (spells, {spellid, spell_on_actor}) \n						    end\n						end\n						\n					    end            \n					end\n				    end\n				end\n\n				table.sort (from, _detalhes.Sort2)\n				table.sort (spells, _detalhes.Sort2)\n\n				for index, spell in ipairs (spells) do\n				    local name, _, icon = GetSpellInfo (spell [1])\n				    GameCooltip:AddLine (name, spell [2])\n				    _detalhes:AddTooltipBackgroundStatusbar()\n				    GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)    \n				end\n\n				_detalhes:AddTooltipSpellHeaderText (\"From\", \"yellow\", #from)\n				_detalhes:AddTooltipHeaderStatusbar (1, 1, 1, 0.6)\n\n				for index, t in ipairs (from) do\n				    GameCooltip:AddLine (t[1], t[2])\n				    _detalhes:AddTooltipBackgroundStatusbar()\n				    \n				    local class, _, _, _, _, r, g, b = _detalhes:GetClass (t [1])\n				    if (class and class ~= \"UNKNOW\") then\n					local texture, l, r, t, b = _detalhes:GetClassIcon (class)\n					GameCooltip:AddIcon (\"Interface\\\\AddOns\\\\Details\\\\images\\\\classes_small_alpha\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height, l, r, t, b)\n				    else\n					GameCooltip:AddIcon (\"Interface\\\\GossipFrame\\\\IncompleteQuestIcon\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    end     \n				    \n				end\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\ICONS\\Spell_Mage_IceNova",
			["script_version"] = 2,
		}, -- [6]
		{
			["source"] = false,
			["author"] = "Details!",
			["percent_script"] = "				local value, top, total, combat, instance = ...\n				local dps = _detalhes:ToK (floor (value) / combat:GetCombatTime())\n				local percent = string.format (\"%.1f\", value/total*100)\n				return dps .. \", \" .. percent\n			",
			["desc"] = "在统计中显示你的技能.",
			["tooltip"] = "			--config:\n			--Background RBG and Alpha:\n			local R, G, B, A = 0, 0, 0, 0.75\n			local R, G, B, A = 0.1960, 0.1960, 0.1960, 0.8697\n\n			--get the parameters passed\n			local spell, combat, instance = ...\n\n			--get the cooltip object (we dont use the convencional GameTooltip here)\n			local GC = GameCooltip\n			GC:SetOption (\"YSpacingMod\", 0)\n\n			local role = DetailsFramework.UnitGroupRolesAssigned (\"player\")\n\n			if (spell.n_dmg) then\n			    \n			    local spellschool, schooltext = spell.spellschool, \"\"\n			    if (spellschool) then\n				local t = _detalhes.spells_school [spellschool]\n				if (t and t.name) then\n				    schooltext = t.formated\n				end\n			    end\n			    \n			    local total_hits = spell.counter\n			    local combat_time = instance.showing:GetCombatTime()\n			    \n			    local debuff_uptime_total, cast_string = \"\", \"\"\n			    local misc_actor = instance.showing (4, _detalhes.playername)\n			    if (misc_actor) then\n				local debuff_uptime = misc_actor.debuff_uptime_spells and misc_actor.debuff_uptime_spells._ActorTable [spell.id] and misc_actor.debuff_uptime_spells._ActorTable [spell.id].uptime\n				if (debuff_uptime) then\n				    debuff_uptime_total = floor (debuff_uptime / instance.showing:GetCombatTime() * 100)\n				end\n				\n				local spell_cast = misc_actor.spell_cast and misc_actor.spell_cast [spell.id]\n				\n				if (not spell_cast and misc_actor.spell_cast) then\n				    local spellname = GetSpellInfo (spell.id)\n				    for casted_spellid, amount in pairs (misc_actor.spell_cast) do\n					local casted_spellname = GetSpellInfo (casted_spellid)\n					if (casted_spellname == spellname) then\n					    spell_cast = amount .. \" (|cFFFFFF00?|r)\"\n					end\n				    end\n				end\n				if (not spell_cast) then\n				    spell_cast = \"(|cFFFFFF00?|r)\"\n				end\n				cast_string = cast_string .. spell_cast\n			    end\n			    \n			    --Cooltip code\n			    GC:AddLine (\"Casts:\", cast_string or \"?\")\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    if (debuff_uptime_total ~= \"\") then\n				GC:AddLine (\"Uptime:\", (debuff_uptime_total or \"?\") .. \"%\")\n				GC:AddStatusBar (100, 1, R, G, B, A)\n			    end\n			    \n			    GC:AddLine (\"Hits:\", spell.counter)\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    local average = spell.total / total_hits\n			    GC:AddLine (\"Average:\", _detalhes:ToK (average))\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    GC:AddLine (\"E-Dps:\", _detalhes:ToK (spell.total / combat_time))\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    GC:AddLine (\"School:\", schooltext)\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    --GC:AddLine (\" \")\n			    \n			    GC:AddLine (\"Normal Hits: \", spell.n_amt .. \" (\" ..floor ( spell.n_amt/total_hits*100) .. \"%)\")\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    local n_average = spell.n_dmg / spell.n_amt\n			    local T = (combat_time*spell.n_dmg)/spell.total\n			    local P = average/n_average*100\n			    T = P*T/100\n			    \n			    GC:AddLine (\"Average / E-Dps: \",  _detalhes:ToK (n_average) .. \" / \" .. format (\"%.1f\",spell.n_dmg / T ))\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    --GC:AddLine (\" \")\n			    \n			    GC:AddLine (\"Critical Hits: \", spell.c_amt .. \" (\" ..floor ( spell.c_amt/total_hits*100) .. \"%)\")\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    if (spell.c_amt > 0) then\n				local c_average = spell.c_dmg/spell.c_amt\n				local T = (combat_time*spell.c_dmg)/spell.total\n				local P = average/c_average*100\n				T = P*T/100\n				local crit_dps = spell.c_dmg / T\n				\n				GC:AddLine (\"Average / E-Dps: \",  _detalhes:ToK (c_average) .. \" / \" .. _detalhes:comma_value (crit_dps))\n			    else\n				GC:AddLine (\"Average / E-Dps: \",  \"0 / 0\")    \n			    end\n			    \n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    --GC:AddLine (\" \")\n			    \n			    GC:AddLine (\"Multistrike: \", spell.m_amt .. \" (\" ..floor ( spell.m_amt/total_hits*100) .. \"%)\")\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    GC:AddLine (\"On Normal / On Critical:\", spell.m_amt - spell.m_crit .. \"  / \" .. spell.m_crit)\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			elseif (spell.n_curado) then\n			    \n			    local spellschool, schooltext = spell.spellschool, \"\"\n			    if (spellschool) then\n				local t = _detalhes.spells_school [spellschool]\n				if (t and t.name) then\n				    schooltext = t.formated\n				end\n			    end\n			    \n			    local total_hits = spell.counter\n			    local combat_time = instance.showing:GetCombatTime()\n			    \n			    --Cooltip code\n			    GC:AddLine (\"Hits:\", spell.counter)\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    local average = spell.total / total_hits\n			    GC:AddLine (\"Average:\", _detalhes:ToK (average))\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    GC:AddLine (\"E-Hps:\", _detalhes:ToK (spell.total / combat_time))\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    GC:AddLine (\"School:\", schooltext)\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    --GC:AddLine (\" \")\n			    \n			    GC:AddLine (\"Normal Hits: \", spell.n_amt .. \" (\" ..floor ( spell.n_amt/total_hits*100) .. \"%)\")\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    local n_average = spell.n_curado / spell.n_amt\n			    local T = (combat_time*spell.n_curado)/spell.total\n			    local P = average/n_average*100\n			    T = P*T/100\n			    \n			    GC:AddLine (\"Average / E-Dps: \",  _detalhes:ToK (n_average) .. \" / \" .. format (\"%.1f\",spell.n_curado / T ))\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    --GC:AddLine (\" \")\n			    \n			    GC:AddLine (\"Critical Hits: \", spell.c_amt .. \" (\" ..floor ( spell.c_amt/total_hits*100) .. \"%)\")\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    if (spell.c_amt > 0) then\n				local c_average = spell.c_curado/spell.c_amt\n				local T = (combat_time*spell.c_curado)/spell.total\n				local P = average/c_average*100\n				T = P*T/100\n				local crit_dps = spell.c_curado / T\n				\n				GC:AddLine (\"Average / E-Hps: \",  _detalhes:ToK (c_average) .. \" / \" .. _detalhes:comma_value (crit_dps))\n			    else\n				GC:AddLine (\"Average / E-Hps: \",  \"0 / 0\")    \n			    end\n			    \n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    --GC:AddLine (\" \")\n			    \n			    GC:AddLine (\"Multistrike: \", spell.m_amt .. \" (\" ..floor ( spell.m_amt/total_hits*100) .. \"%)\")\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    GC:AddLine (\"On Normal / On Critical:\", spell.m_amt - spell.m_crit .. \"  / \" .. spell.m_crit)\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			end\n			",
			["attribute"] = false,
			["name"] = "我的技能",
			["script"] = "				--get the parameters passed\n				local combat, instance_container, instance = ...\n				--declade the values to return\n				local total, top, amount = 0, 0, 0\n\n				local player\n				local pet_attribute\n				\n				local role = DetailsFramework.UnitGroupRolesAssigned (\"player\")\n				local spec = DetailsFramework.GetSpecialization()\n				role = spec and DetailsFramework.GetSpecializationRole (spec) or role\n\n				if (role == \"DAMAGER\") then\n					player = combat (DETAILS_ATTRIBUTE_DAMAGE, _detalhes.playername)\n					pet_attribute = DETAILS_ATTRIBUTE_DAMAGE\n				elseif (role == \"HEALER\") then    \n					player = combat (DETAILS_ATTRIBUTE_HEAL, _detalhes.playername)\n					pet_attribute = DETAILS_ATTRIBUTE_HEAL\n				else\n					player = combat (DETAILS_ATTRIBUTE_DAMAGE, _detalhes.playername)\n					pet_attribute = DETAILS_ATTRIBUTE_DAMAGE\n				end\n\n				--do the loop\n\n				if (player) then\n					local spells = player:GetSpellList()\n					for spellid, spell in pairs (spells) do\n						instance_container:AddValue (spell, spell.total)\n						total = total + spell.total\n						if (top < spell.total) then\n							top = spell.total\n						end\n						amount = amount + 1\n					end\n				    \n					for _, PetName in ipairs (player.pets) do\n						local pet = combat (pet_attribute, PetName)\n						if (pet) then\n							for spellid, spell in pairs (pet:GetSpellList()) do\n								instance_container:AddValue (spell, spell.total, nil, \" (\" .. PetName:gsub ((\" <.*\"), \"\") .. \")\")\n								total = total + spell.total\n								if (top < spell.total) then\n									top = spell.total\n								end\n								amount = amount + 1\n							end\n						end\n					end\n				end\n\n				--return the values\n				return total, top, amount\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\ICONS\\ABILITY_MAGE_ARCANEBARRAGE",
			["script_version"] = 6,
		}, -- [7]
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "显示对标记骷髅的目标造成的伤害数值",
			["tooltip"] = "				--get the parameters passed\n				local actor, combat, instance = ...\n\n				--get the cooltip object (we dont use the convencional GameTooltip here)\n				local GameCooltip = GameCooltip\n\n				--Cooltip code\n				local format_func = Details:GetCurrentToKFunction()\n\n				--Cooltip code\n				local RaidTargets = actor.raid_targets\n\n				local DamageOnStar = RaidTargets [128]\n				if (DamageOnStar) then\n				    --RAID_TARGET_8 is the built-in localized word for 'Skull'.\n				    GameCooltip:AddLine (RAID_TARGET_8 .. \":\", format_func (_, DamageOnStar))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_8\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n			",
			["attribute"] = false,
			["name"] = "对骷髅标记目标造成的伤害",
			["script"] = "				--get the parameters passed\n				local Combat, CustomContainer, Instance = ...\n				--declade the values to return\n				local total, top, amount = 0, 0, 0\n				\n				--raid target flags: \n				-- 128: skull \n				-- 64: cross\n				-- 32: square\n				-- 16: moon\n				-- 8: triangle\n				-- 4: diamond\n				-- 2: circle\n				-- 1: star\n				\n				--do the loop\n				for _, actor in ipairs (Combat:GetActorList (DETAILS_ATTRIBUTE_DAMAGE)) do\n				    if (actor:IsPlayer()) then\n					if (actor.raid_targets [128]) then\n					    CustomContainer:AddValue (actor, actor.raid_targets [128])\n					end        \n				    end\n				end\n\n				--if not managed inside the loop, get the values of total, top and amount\n				total, top = CustomContainer:GetTotalAndHighestValue()\n				amount = CustomContainer:GetNumActors()\n\n				--return the values\n				return total, top, amount\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\TARGETINGFRAME\\UI-RaidTargetingIcon_8",
			["script_version"] = 3,
		}, -- [8]
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "显示对其它所有标记的目标造成的伤害数值",
			["tooltip"] = "				--get the parameters passed\n				local actor, combat, instance = ...\n\n				--get the cooltip object\n				local GameCooltip = GameCooltip\n\n				local format_func = Details:GetCurrentToKFunction()\n\n				--Cooltip code\n				local RaidTargets = actor.raid_targets\n\n				local DamageOnStar = RaidTargets [1]\n				if (DamageOnStar) then\n				    GameCooltip:AddLine (RAID_TARGET_1 .. \":\", format_func (_, DamageOnStar))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_1\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnCircle = RaidTargets [2]\n				if (DamageOnCircle) then\n				    GameCooltip:AddLine (RAID_TARGET_2 .. \":\", format_func (_, DamageOnCircle))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_2\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnDiamond = RaidTargets [4]\n				if (DamageOnDiamond) then\n				    GameCooltip:AddLine (RAID_TARGET_3 .. \":\", format_func (_, DamageOnDiamond))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_3\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnTriangle = RaidTargets [8]\n				if (DamageOnTriangle) then\n				    GameCooltip:AddLine (RAID_TARGET_4 .. \":\", format_func (_, DamageOnTriangle))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_4\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnMoon = RaidTargets [16]\n				if (DamageOnMoon) then\n				    GameCooltip:AddLine (RAID_TARGET_5 .. \":\", format_func (_, DamageOnMoon))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_5\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnSquare = RaidTargets [32]\n				if (DamageOnSquare) then\n				    GameCooltip:AddLine (RAID_TARGET_6 .. \":\", format_func (_, DamageOnSquare))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_6\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnCross = RaidTargets [64]\n				if (DamageOnCross) then\n				    GameCooltip:AddLine (RAID_TARGET_7 .. \":\", format_func (_, DamageOnCross))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_7\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n			",
			["attribute"] = false,
			["name"] = "对其它标记目标造成的伤害",
			["script"] = "				--get the parameters passed\n				local Combat, CustomContainer, Instance = ...\n				--declade the values to return\n				local total, top, amount = 0, 0, 0\n\n				--do the loop\n				for _, actor in ipairs (Combat:GetActorList (DETAILS_ATTRIBUTE_DAMAGE)) do\n				    if (actor:IsPlayer()) then\n					local total = (actor.raid_targets [1] or 0) --star\n					total = total + (actor.raid_targets [2] or 0) --circle\n					total = total + (actor.raid_targets [4] or 0) --diamond\n					total = total + (actor.raid_targets [8] or 0) --tiangle\n					total = total + (actor.raid_targets [16] or 0) --moon\n					total = total + (actor.raid_targets [32] or 0) --square\n					total = total + (actor.raid_targets [64] or 0) --cross\n					\n					if (total > 0) then\n					    CustomContainer:AddValue (actor, total)\n					end\n				    end\n				end\n\n				--if not managed inside the loop, get the values of total, top and amount\n				total, top = CustomContainer:GetTotalAndHighestValue()\n				amount = CustomContainer:GetNumActors()\n\n				--return the values\n				return total, top, amount\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\TARGETINGFRAME\\UI-RaidTargetingIcon_5",
			["script_version"] = 3,
		}, -- [9]
		{
			["source"] = false,
			["author"] = "Details!",
			["total_script"] = "				local value, top, total, combat, instance = ...\n\n				--get the time of overall combat\n				local OverallCombatTime = Details:GetCombat (-1):GetCombatTime()\n\n				--get the time of current combat if the player is in combat\n				if (Details.in_combat) then\n				    local CurrentCombatTime = Details:GetCombat (0):GetCombatTime()\n				    OverallCombatTime = OverallCombatTime + CurrentCombatTime\n				end\n\n				--build the string\n				local ToK = Details:GetCurrentToKFunction()\n				local s = ToK (_, value / OverallCombatTime)\n				\n				if (instance.row_info.textR_show_data[3]) then\n				    s = ToK (_, value) .. \" (\" .. s .. \", \"\n				else\n				    s = ToK (_, value) .. \" (\" .. s\n				end\n\n				return s\n			",
			["desc"] = "Show overall damage done on the fly.",
			["attribute"] = false,
			["script"] = "				--init:\n				local combat, instance_container, instance = ...\n				local total, top, amount = 0, 0, 0\n\n				--get the overall combat\n				local OverallCombat = Details:GetCombat (-1)\n				--get the current combat\n				local CurrentCombat = Details:GetCombat (0)\n\n				if (not OverallCombat.GetActorList or not CurrentCombat.GetActorList) then\n				    return 0, 0, 0\n				end\n\n				--get the damage actor container for overall\n				local damage_container_overall = OverallCombat:GetActorList ( DETAILS_ATTRIBUTE_DAMAGE )\n				--get the damage actor container for current\n				local damage_container_current = CurrentCombat:GetActorList ( DETAILS_ATTRIBUTE_DAMAGE )\n\n				--do the loop:\n				for _, player in ipairs ( damage_container_overall ) do \n				    --only player in group\n				    if (player:IsGroupPlayer()) then\n					instance_container:AddValue (player, player.total)\n				    end\n				end\n\n				if (Details.in_combat) then\n				    for _, player in ipairs ( damage_container_current ) do \n					--only player in group\n					if (player:IsGroupPlayer()) then\n					    instance_container:AddValue (player, player.total)        \n					end\n				    end\n				end\n\n				total, top =  instance_container:GetTotalAndHighestValue()\n				amount =  instance_container:GetNumActors()\n\n				--return:\n				return total, top, amount\n			",
			["name"] = "动态总体伤害",
			["tooltip"] = "				--get the parameters passed\n				local actor, combat, instance = ...\n\n				--get the cooltip object (we dont use the convencional GameTooltip here)\n				local GameCooltip = GameCooltip2\n\n				--Cooltip code\n				--get the overall combat\n				local OverallCombat = Details:GetCombat (-1)\n				--get the current combat\n				local CurrentCombat = Details:GetCombat (0)\n\n				local AllSpells = {}\n\n				--overall\n				local player = OverallCombat [1]:GetActor (actor.nome)\n				local playerSpells = player:GetSpellList()\n				for spellID, spellTable in pairs (playerSpells) do\n				    AllSpells [spellID] = spellTable.total\n				end\n\n				--current\n				local player = CurrentCombat [1]:GetActor (actor.nome)\n				local playerSpells = player:GetSpellList()\n				for spellID, spellTable in pairs (playerSpells) do\n				    AllSpells [spellID] = (AllSpells [spellID] or 0) + (spellTable.total or 0)\n				end\n\n				local sortedList = {}\n				for spellID, total in pairs (AllSpells) do\n				    tinsert (sortedList, {spellID, total})\n				end\n				table.sort (sortedList, Details.Sort2)\n\n				local format_func = Details:GetCurrentToKFunction()\n\n				--build the tooltip\n				for i, t in ipairs (sortedList) do\n				    local spellID, total = unpack (t)\n				    if (total > 1) then\n					local spellName, _, spellIcon = Details.GetSpellInfo (spellID)\n					\n					GameCooltip:AddLine (spellName, format_func (_, total))\n					Details:AddTooltipBackgroundStatusbar()\n					GameCooltip:AddIcon (spellIcon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    end\n				end\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\ICONS\\Achievement_Quests_Completed_08",
			["script_version"] = 4,
		}, -- [10]
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "Damage done to shields",
			["tooltip"] = "				--get the parameters passed\n				local actor, Combat, instance = ...\n\n				--get the cooltip object (we dont use the convencional GameTooltip here)\n				local GameCooltip = GameCooltip\n\n				--Cooltip code\n				--get the actor total damage absorbed\n				local totalAbsorb = actor.totalabsorbed\n				local format_func = Details:GetCurrentToKFunction()\n\n				--get the damage absorbed by all the actor pets\n				for petIndex, petName in ipairs (actor.pets) do\n				    local pet = Combat :GetActor (1, petName)\n				    if (pet) then\n					totalAbsorb = totalAbsorb + pet.totalabsorbed\n				    end\n				end\n\n				GameCooltip:AddLine (actor:Name(), format_func (_, actor.totalabsorbed))\n				Details:AddTooltipBackgroundStatusbar()\n\n				for petIndex, petName in ipairs (actor.pets) do\n				    local pet = Combat :GetActor (1, petName)\n				    if (pet) then\n					totalAbsorb = totalAbsorb + pet.totalabsorbed\n					\n					GameCooltip:AddLine (petName, format_func (_, pet.totalabsorbed))\n					Details:AddTooltipBackgroundStatusbar()        \n					\n				    end\n				end\n			",
			["attribute"] = false,
			["name"] = "对护盾造成的伤害",
			["script"] = "				--get the parameters passed\n				local Combat, CustomContainer, Instance = ...\n				--declade the values to return\n				local total, top, amount = 0, 0, 0\n\n				--do the loop\n				for index, actor in ipairs (Combat:GetActorList(1)) do\n				    if (actor:IsPlayer()) then\n					\n					--get the actor total damage absorbed\n					local totalAbsorb = actor.totalabsorbed\n					\n					--get the damage absorbed by all the actor pets\n					for petIndex, petName in ipairs (actor.pets) do\n					    local pet = Combat :GetActor (1, petName)\n					    if (pet) then\n						totalAbsorb = totalAbsorb + pet.totalabsorbed\n					    end\n					end\n					\n					--add the value to the actor on the custom container\n					CustomContainer:AddValue (actor, totalAbsorb)        \n					\n				    end\n				end\n				--loop end\n\n				--if not managed inside the loop, get the values of total, top and amount\n				total, top = CustomContainer:GetTotalAndHighestValue()\n				amount = CustomContainer:GetNumActors()\n\n				--return the values\n				return total, top, amount\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\ICONS\\Spell_Holy_PowerWordShield",
			["script_version"] = 1,
		}, -- [11]
	},
	["performance_profiles"] = {
		["Dungeon"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["RaidFinder"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Battleground15"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Battleground40"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Mythic"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Arena"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Raid30"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Raid15"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
	},
	["exit_log"] = {
		"1 - Closing Janela Info.", -- [1]
		"2 - Clearing user place from instances.", -- [2]
		"4 - Reversing switches.", -- [3]
		"6 - Saving Config.", -- [4]
		"7 - Saving Profiles.", -- [5]
		"8 - Saving nicktag cache.", -- [6]
	},
	["report_where"] = "PARTY",
	["lastUpdateWarning"] = 0,
	["always_use_profile"] = false,
}
