
CodexConfig = {
	["showLowLevel"] = false,
	["showHighLevel"] = true,
	["colorBySpawn"] = true,
	["autoAccept"] = false,
	["questMarkerSize"] = 20,
	["spawnMarkerSize"] = 20,
	["allQuestGivers"] = true,
	["trackingMethod"] = 1,
	["currentQuestGivers"] = true,
	["showFestival"] = false,
	["autoTurnin"] = false,
	["nameplateIcon"] = true,
	["minimumDropChance"] = 2,
}
CodexHiddenQuests = {
}
CodexBrowserFavorites = {
	["items"] = {
	},
	["objets"] = {
	},
	["quests"] = {
	},
	["units"] = {
	},
}
CodexColors = {
	["高地阔步龙"] = {
		0.792156862745098, -- [1]
		0.635294117647059, -- [2]
		0.149019607843137, -- [3]
	},
	["辛迪加潜伏者"] = {
		0.184313725490196, -- [1]
		0.109803921568627, -- [2]
		0.0431372549019608, -- [3]
	},
	["盐湖食腐鹫"] = {
		0.698039215686275, -- [1]
		0.00784313725490196, -- [2]
		0.231372549019608, -- [3]
	},
	["枯木掷斧者"] = {
		0.623529411764706, -- [1]
		0.87843137254902, -- [2]
		0.505882352941176, -- [3]
	},
	["枯木巫医"] = {
		0.67843137254902, -- [1]
		0.356862745098039, -- [2]
		0.207843137254902, -- [3]
	},
	["丛林捕猎者"] = {
		0.517647058823529, -- [1]
		0.905882352941177, -- [2]
		0.109803921568627, -- [3]
	},
	["烈焰流放者"] = {
		0.996078431372549, -- [1]
		0.756862745098039, -- [2]
		0.894117647058824, -- [3]
	},
	["雷霆流放者"] = {
		0.956862745098039, -- [1]
		0.176470588235294, -- [2]
		0.407843137254902, -- [3]
	},
}
